[
  {
    "company_name": "CompanyCam",
    "linkedin_company_page": "https://www.linkedin.com/company/companycam/life",
    "title": "Senior Software Engineer (Ruby on Rails)",
    "job_location": "Austin, TX",
    "posted_date": "2 weeks ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Hi, we're CompanyCam. We're a simple-to-use photo documentation and productivity app for contractors of all commercial and home services industries. Packed with intuitive functionality, CompanyCam facilitates unparalleled communication and accountability across a contractor's entire business. We're committed to providing a consumer-grade, game-changing experience that helps our users build trust within their company and with their customers. But don't let that corporate description fool you—the people behind our buttoned-up product are laid-back (but hardworking), genuine, and kickass, and you could be one of them! The Role We're looking for a sharp, driven, problem-solving Senior Software Engineer (Ruby on Rails) to join our engineering team. As a Senior Software Engineer, you'll work alongside other engineers, designers, and product managers to tackle everything from huge company initiatives to modest but important bug fixes. While your primary focus will be backend development, we value engineers who are T-shaped, bringing deep expertise in one area while being comfortable contributing in others. Whether that means diving into frontend code, supporting mobile efforts, or lending an extra set of eyes in discovery, you'll collaborate with your teammates to move work forward. Most importantly, you'll actively contribute to the evolution of the culture and processes of a growing engineering team, especially our backend engineering discipline. We want senior devs with experience effectively scaling codebases and iterating on processes as part of a growing team and with interest in mentoring to help our devs grow, too. Working At CompanyCam Our engineering team is remote-first, spanning every time zone in the United States. We welcome people from all backgrounds and really don't care whether or not you have a CS degree or even a high school diploma. All that matters is that you're not an a**hole and you're good at what you do. At CompanyCam we're driven to produce work with meaningful outcomes. That means not just dumping features and \"improvements\" but being able to reflect and learn from our outputs. We're actively working to center our work on continuous discovery habits (CDH) as outlined by Teresa Torres. Our teams are made up of a product manager, a product designer, a tech lead and an appropriate number of engineers for the scope of your team. We take a flexible approach, pulling from Agile, Scrum, Kanban, and even Shape Up. Rather than being overly prescriptive, we provide guardrails and just enough constraints to keep teams moving. Each team is expected to collaborate, iterate, and refine their best practices to produce high-quality work. What You'll Do Design, implement and deliver complex, cross-cutting features and systems in Ruby on Rails, Postgres, GraphQL, and REST, and occasionally in React and React Native. Lead efforts to address technical debt and system reliability, proactively identifying areas for refactoring or optimization. Influence and evolve the architecture and system design, anticipating future needs and driving long-term improvements across services and applications. Set and uphold high standards for code quality, testing coverage, and documentation, mentoring others to do the same. Drive improvements to internal tooling, CI/CD pipelines, and monitoring systems to enhance developer experience and system resilience. Facilitate technical discussions and decision-making, helping the team navigate trade-offs and align on best solutions. Act as a point of escalation for complex technical challenges, supporting team members in unblocking progress. Partner closely with product managers, designers, and engineers, shaping feature direction by identifying technical opportunities, risks, and trade-offs early in discovery. What You'll Bring Must-haves These are our non-negotiables: Show up: Have the courage to do difficult but necessary work. Grow up: Take ownership, learn continuously, and bring a growth mindset. Do good: Treat your teammates and customers the way you'd want to be treated. 5+ years of professional software development experience. (Not all years of experience are created equal, so this one isn't set in stone). Advanced proficiency in Ruby on Rails (and/or other MVC frameworks) and relational databases, with demonstrated ability to design and optimize scalable data models and APIs. Familiarity with Redis, PostgreSQL, and Sidekiq in a production environment. Experience contributing across the full stack, including front-end, back-end, and data layers. Demonstrated experience in leveraging artificial intelligence (AI) to build, enhance, or optimize tools and features within products, driving innovation and improving user experience. Ability to handle complex tasks and ambiguous problems without guidance. Understanding of business trade-offs and ability to effectively communicate the risks and benefits of various technical approaches. Strong collaboration skills with the ability to lift up the team by providing mentorship and proactive feedback. You live and work permanently in the U.S. (We're not set up to hire outside the U.S.). Nice-to-haves You'll encounter the following technologies with varying frequency — experience with them is a plus, but not required: AWS (S3, EC2, etc.) ElasticSearch MongoDB React React Native Terraform (we don't write much, but familiarity is helpful) GraphQL Experience integrating with large language models (e.g., OpenAI, Gemini) Benefits and Compensation This is a salaried position at CompanyCam. Our salary range is $175,000 - $200,000 per year and is based on experience. We also offer meaningful equity and other benefits. CompanyCam is an equal-opportunity employer committed to respect, inclusion, and growth. We work hard, take responsibility, and support each other. Great ideas come from all backgrounds, and we carefully consider every applicant without regard to personal characteristics or traits. Even if your work experience doesn't align perfectly, we encourage you to apply. What really matters to us is your potential, your passion, and your commitment to learning, innovation, and contributing meaningfully to our team. For any accommodations or technical issues related to the online application or interview process, please email jobs@companycam.com and we'll respond promptly. Please do not include any medical or health information in your message. Note: Resumes sent to this email will not be reviewed or responded to. To be considered for a position, you must apply directly through our careers page.",
    "linkedin_job_id": "4315359992"
  },
  {
    "company_name": "Mission.dev",
    "linkedin_company_page": "https://www.linkedin.com/company/mission-dev/life",
    "title": "Back End Developer (Ruby on Rails)",
    "job_location": "Boston, MA",
    "posted_date": "Boston, MA · Reposted 16 hours ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Agreement type: full-time employee, 40 hours per week, hired directly by the client. Location of the engineer: Remote 100%. Candidates can be based anywhere in the U.S., but a Boston, MA, or East Coast location is preferred for collaboration. Our company description Mission is a platform for hiring, vetting, and managing software development talent. It enables our clients to connect with the world’s best talent to build mission-critical software products. About the client A fully remote company transforming digital advertising by helping brands connect with new consumers through performance-driven marketing. Profitable, fast-growing, and trusted by leading brands across ecommerce, entertainment, travel, and consumer goods, this organization offers a unique opportunity to join a high-growth team at a pivotal stage of expansion. About the role As a Senior Software Engineer, you will own projects end to end, write clean and reliable code, and play a key role in scaling our AWS infrastructure. This is a high impact role with direct visibility into how your work drives growth. To succeed, you must be data driven, with a passion for continuously measuring and improving customer experience, and a natural focus on AWS, scalability, and performance. What You’ll Do Own your assigned development projects from start to finish Collaborate with our Chief Architect to design, optimize, enhance and evolve our AWS infrastructure (EC2, RDS, ECS, etc.) Implement CI/CD pipelines and monitor system health Contribute to architectural decisions across the stack Troubleshoot performance and infrastructure issues, and proactively identify areas for improvement Write clean, tested, maintainable code—and help others do the same through code reviews What You Bring Minimum of 10 years of professional experience as a Backend / Infrastructure Software Engineer Proficient in Ruby onRails Experience with SQL data bases Hands-on experience with AWS infrastructure (EC2, RDS, S3, IAM, ECS, etc.) or Google Cloud infrastructure in a commercial setting Comfortable with CI/CD workflows and Linux environments Strong grasp of software architecture principles and design patterns Able to write clean, maintainable, and efficient code Strong interpersonal and communication skills Able to persevere through engineering challenges: willingness to embrace and not shy away from a problem you haven’t seen before Open to new ideas and methods of problem solving Passion for backend and infrastructure development Self-motivation, grit, & tenacity Ownership Mindset: Proactive and self-driven with a strong sense of initiative, consistently taking responsibility, and exceeds expectations Team Tech StackRuby on RailsPost greSQ LRSpecJava Scrip tHTML5 Vue.js Redis Preferred Skills Experience with distributed systems Experience performance tuning and scaling systems with high volumes of user traffic Experience with Apache Spark Familiarity with database systems such as PostgreSQL, MySQL or NoSQL What you get Competitive compensation and comprehensive benefits (401K, Medical/Dental/Vision), and we offer all full-time employees the potential to hold company equity Flexible remote work Unlimited Responsible PTO Great opportunity to join a growing, cash-flow-positive company while having a direct impact on revenue, growth, scale, and future success.",
    "linkedin_job_id": "4311478396"
  },
  {
    "company_name": "Underdog",
    "linkedin_company_page": "https://www.linkedin.com/company/underdogfantasy/life",
    "title": "Software Engineer - Ruby on Rails",
    "job_location": "Remote",
    "posted_date": "1 week ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job At Underdog, we make sports more fun. Our thesis is simple: build the best products and we’ll build the biggest company in the space, because there’s so much more to be built for sports fans. We’re just over five years in, and we’re one of the fastest-growing sports companies ever, most recently valued at $1.3B. And it’s still the early days. We’ve built and scaled multiple games and products across fantasy sports, sports betting, and prediction markets, all united in one seamless, simple, easy to use, intuitive and fun app. Underdog isn’t for everyone. One of our core values is give a sh*t. The people who win here are the ones who care, push, and perform. If that’s you, come join us. Winning as an Underdog is more fun. About the role and why it’s unique: Work on cutting edge projects focused on gamifying and building unique features into our fantasy and sports betting products Design and develop clean, well-structured, and performant features — your work will be used by millions of our customers Work closely with other product-minded individuals to shape and deliver the next wave of transformative fantasy and sports betting products Collaborate with client engineers and product stakeholders from start to finish, openly communicating issues, asking clarifying questions, and raising concerns when needed Advocate for best practices to create strong foundational development practices for our growing team Grow in a high-agency environment where you have equity in technical decision-making and are accountable for those decisions Learn from some of the best engineers and leaders in the fantasy and sports betting world while bringing your own unique perspective; we elevate each other to make Underdog the best sports gaming platform now and for the future! Who you are: Product-minded engineer with 2+ years of software engineering experience Passionate about software development, with 1+ years of professional Ruby and Ruby on Rails development experience Collaborative by nature and passionate about fostering best practices for the betterment of the team Excellent communication, analytical, and problem solving skills with both engineers and product Even better if you have: Experience in fantasy sports and/or sports betting Worked through a significant growth phase of a company Built dashboards in or spent time grokking info from DataDog or Amplitude Experience building highly scalable and available systems to handle high traffic conditions with low latency Our target starting base salary range for this position is between $135,000 and $150,000, plus target equity. The starting base salary will depend on a number of factors, including the candidate’s skills and experience, among other things. What we can offer you: Unlimited PTO (we're extremely flexible with the exception of the first few weeks before & into the NFL season) 16 weeks of fully paid parental leave A $500 home office allowance A connected virtual first culture with a highly engaged distributed workforce 5% 401k match, FSA, company paid health, dental, and vision plan options for employees and dependents This position may require sports betting licensure based on certain state regulations. Underdog is an equal opportunity employer and doesn't discriminate on the basis of creed, race, sexual orientation, gender, age, disability status, or any other defining characteristic.",
    "linkedin_job_id": "4331355961"
  },
  {
    "company_name": "8am",
    "linkedin_company_page": "https://www.linkedin.com/company/weare8am/life",
    "title": "Senior Full-Stack Software Engineer | Ruby on Rails",
    "job_location": "Austin, TX",
    "posted_date": "5 days ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job It's a new day with a new opportunity at 8am! We are looking for a Senior Fullstack Senior Software Engineer to help build out our core CRM platform in MyCase. The core team will focus on driving more value to our ever growing customer base through developing a better customer workflow, enhancing our automation and developing a robust personalization platform. About us: Founded in 2005, 8am™ (formerly AffiniPay) is the professional business platform built to help legal, accounting, and other client-focused professionals run stronger, more profitable businesses. Today, more than 250,000 professionals across the U.S. trust 8am to help them work smarter, serve clients better, and unlock their full potential. We have been recognized as one of Inc 5000's fastest growing companies in the U.S. for 13 years in a row, and as a result, our teams continue to grow as well! What You'll Do Design and implement scalable applications using modern web application frameworks (e.g., Rails, React, Node, NextJS). Utilize and maintain reusable component libraries. Collaborate with product teams to assess trade-offs, identify risks, and align improvements with business objectives. Modernize web applications to enhance user experience, improve performance, and ensure scalability. Mentor and coach software engineers, fostering professional growth within the team. Work closely with UX teams to design and ship web applications with a focus on usability. Support software deployments by debugging, troubleshooting, and coordinating with DevOps and QA engineers. Partner with technical and non-technical stakeholders to gather requirements, propose solutions, and align with business goals. Lead team ceremonies, including sprint planning, grooming, and retrospectives, ensuring effective communication and coordination. Drive technology initiatives to enhance application performance, scalability, and maintainability. Stay updated with industry trends and emerging technologies to bring innovation to the team. Provide technical expertise to the broader engineering group to drive positive outcomes. About You BS in Computer Science or related field, or equivalent professional experience. 7+ years of experience designing, implementing, and debugging large-scale, cloud-based solutions. Extensive experience building production-grade React applications, including developing reusable components, managing complex state, and optimizing front-end performance. Professional experience with Ruby on Rails, with the ability to develop and maintain APIs and other backend functionality. Experience with Lean product development and Agile frameworks (e.g., Scrum, Kanban). Strong understanding of SOLID design principles and software design patterns. Proficiency in SQL and experience working with relational databases such as PostgreSQL or MySQL. Excellent teamwork, documentation, and communication skills. Preferred Skills & Experience Experience with cloud platforms (e.g., AWS, Google Cloud Platform). Experience with Rails (or equivalent), NodeJS and NextJS. Experience with React, Bootstrap and other frontend technologies. Experience building scalable Software as a Service (SaaS) applications. Why 8am At 8am, our culture is shaped by the people who bring it to life every day. Together, we build a company rooted in continuous learning, genuine community, holistic wellness, and meaningful engagement—values that empower us as individuals and unite us as a team. Our culture is grounded in our core values: Work Smart, Win Fast; Outshine Ordinary, and We Find a Way. These values drive how we serve our customers and work with each other in a collaborative, inspiring, and empowering environment, every day. Here's how we support our 8Team: Health Insurance Coverage: We offer our 8Team a variety of medical, dental, and vision plans, designed to fit your needs, including a 100% company-paid HDHP plan for employees. Financial perks: We offer a competitive compensation and benefits package including annual bonuses, equity options and 401(k) or RRSP if in Canada, with a company match for all team members. Time for what matters: Flexible Time Off, paid holidays, and a parental leave program for our new parents. Wellness: Wellness stipends, mental health support, and one-on-one nutrition coaching. Learning and Development: Continuous learning through 8am.edu, leadership programs, professional development funds, and individually focused talent development. Giving back to the communities around us: Participate in our charitable matching gift program, paid time off for volunteer service, and company-sponsored volunteer events (both local and virtually). Engagement: Virtual and in-person team-building events, quarterly award recognition through our Rise & Shine Award of Excellence Program, and our peer-to-peer appreciation platform. At 8am, we don't just offer benefits—we create an environment where people can thrive, grow, and make a real impact every day. Diversity, equity & inclusion at 8am At 8am, we recognize that innovation occurs with a strong team of people who are diverse in background, personality, talent and ideas. Experience comes in many forms and ensuring a diverse and inclusive workplace where we continue to learn from each other is an integral part of our culture. We are committed to creating a welcoming and transparent environment for all that embraces those differences through education, equal access to opportunities and information, inclusionary programs, and community outreach. Security advisory Our hiring teams at 8am are dedicated to recruiting top talent that share our passion for serving the professional services industry through innovative financial technology. As such, our Talent Acquisition Team only follows legitimate hiring practices. We will always communicate with our candidates using emails with the 8am domain and will never ask for sensitive/personal data during the application process. All interviews take place over phone call, Zoom/Google Meet or in person. All offers are communicated verbally by our Talent Acquisition Specialists with a written offer letter as a follow up.",
    "linkedin_job_id": "4319985490"
  },
  {
    "company_name": "SonderMind",
    "linkedin_company_page": "https://www.linkedin.com/company/sondermind/life",
    "title": "Staff Ruby on Rails Engineer",
    "job_location": "Denver, CO",
    "posted_date": "3 weeks ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job About SonderMind At SonderMind, we believe everyone deserves one personalized, connected, and effective mental health destination to take care of their mental health and well-being at any stage of life. SonderMind care encompasses everything from therapy and medication management to meditation and mindfulness exercises. Our clinicians leverage our digital tools and research to deliver increasingly high-quality care and to develop thriving practices. Combining technology and human connection, SonderMind drives better outcomes through our comprehensive approach. Learn more about SonderMind at sondermind.com or download the mobile app, available on iOS and Android. To follow the latest SonderMind news, get to know our clients, and learn about what it’s like to work at SonderMind, you can follow us on Instagram, Linkedin, and Twitter. About The Role We’re turning our online mental health services into a provider platform that any health plan, payer, employer, or med-tech app can plug into. You’ll design and ship the APIs, webhooks, and integration points that make that possible. Your work will remove friction for partners, protect patient data, and get people care faster. What you’ll do Own key platform APIs end to end, from RFC to rollout and monitoring Shape the partner developer experience (docs, SDKs, sample apps, sandbox flows) Build clean contracts and stable interfaces for identity, eligibility, scheduling, claims, and reporting Work with standards like OAuth2/OpenID Connect and FHIR/HL7 when they help, and keep things simple when they don’t Collaborate with product, security, data, and customer teams to turn real integration pain points into shipped solutions Measure impact and iterate quickly Lead the design, development, and optimization of services built on Ruby on Rails. Architect and implement event-based systems leveraging RabbitMQ and other messaging technologies. Design and optimize schemas and queries for relational databases (e.g., PostgreSQL, MySQL). Drive the development of FHIR-compliant APIs for healthcare interoperability. Provide technical leadership and mentorship to engineers across teams. Partner with product, compliance, and business stakeholders to translate healthcare workflows into reliable software solutions. Advocate for engineering best practices including code quality, testing, CI/CD, and system observability. Collaborate in cross-functional discussions on scalability, security, and patient data protection. What does success look like? 30 days: understand the systems, earn trust, adapt to the workflow: learn how the stack fits together, ship a few quick wins, and line up the first bigger initiative. Find your groove on the refiners meetings, turning business requirements into sharp focused JIRA tickets. Develop a technical design document for a larger feature and get it rolling. 60 days: lead an initiative and de-risk it: Take ownership of a cross-team project from design to first value in prod and raise the bar through reviews, patterns, and mentoring. Find your cruising speed and hit your sprint velocity. Root out a significant piece of technical debt and resolve it. 90 days: Establish a leadership presence on the team. Propose and roll out changes that affect higher quality releases and reduce bug rates. Understand the strengths and shortcomings of the system and propose a roadmap to improve system reliability and observability. Acquire deep expertise on our systems, communicate with external business partners and become the leading expert on our Enterprise APIs. Who You Are Required: 10+ years of professional software engineering experience. 5+ years with Ruby on Rails in large-scale production environments. Proven experience with event-driven architectures and RabbitMQ (or similar message brokers). Strong background in relational database design and performance optimization. Hands-on experience developing FHIR-based APIs. Familiarity with healthcare systems, interoperability standards, and compliance considerations (e.g., HIPAA). Ability to provide architectural guidance, mentor engineers, and drive technical initiatives Preferred: Experience with Python in production systems. Background in building highly available, distributed systems in healthcare or other regulated industries. A mix of startup and enterprise healthcare experience. Experience scaling systems in cloud-native environments (AWS). Strong communication skills, with the ability to work effectively across technical and non-technical stakeholders. Our Benefits The anticipated salary range for this role is $160,000 - $180,000 annually. Final compensation will be determined based on a variety of factors, including relevant experience, skills, education, and past performance. In addition to base salary, this position may also be eligible for a variable bonus and equity. As leaders in redesigning behavioral health, we walk the walk with our employees' benefits. We want the experience of working at SonderMind to accelerate people’s careers and enrich their lives, so we focus on meeting SonderMinders wherever they are and supporting them in all facets of their lives and work. Our benefits include: A generous PTO policy, with a minimum of three weeks off per year A holiday schedule that follows standard U.S. holidays Free therapy coverage benefits to ensure employees have access to the care they need (must be enrolled in a qualifying medical plan to participate) Competitive Medical, Dental, and Vision coverage, with plans to meet every need — including HSA (with $1,100 company contribution) and FSA options Employer-paid short-term disability, long-term disability, life & AD&D, plus coverage of the salary difference for up to seven weeks of short-term disability leave (after the required waiting period) Eight weeks of paid Parental Leave; if the parent also qualifies for STD, this benefit is in addition, allowing for 8–16 weeks of paid leave 401(k) retirement plan with 100% match on up to 4% of base salary, immediately vested Join teammates from across the country at our annual company gathering Company shutdown between Christmas and New Year’s Supplemental life insurance, pet insurance, commuter benefits, and more! Application Deadline This position will be an ongoing recruitment process and will be open until filled. Equal Opportunity SonderMind does not discriminate in employment opportunities or practices based on race, color, creed, sex, gender, gender identity or expression, pregnancy, childbirth or related medical conditions, religion, veteran and military status, marital status, registered domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition (including genetic information or characteristics), sexual orientation, or any other characteristic protected by applicable federal, state, or local laws.",
    "linkedin_job_id": "4311826808"
  },
  {
    "company_name": "Stripe",
    "linkedin_company_page": "https://www.linkedin.com/company/stripe/life",
    "title": "Payments Fraud Investigator",
    "job_location": "Remote",
    "posted_date": "4 days ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Who we are About Stripe Stripe is a financial infrastructure platform for businesses. Millions of companies - from the world’s largest enterprises to the most ambitious startups - use Stripe to accept payments, grow their revenue, and accelerate new business opportunities. Our mission is to increase the GDP of the internet, and we have a staggering amount of work ahead. That means you have an unprecedented opportunity to put the global economy within everyone's reach while doing the most important work of your career. About The Team The mission of Fraud Operations is to act as guardians of the global financial ecosystem by proactively reducing fraud, making it difficult and unprofitable for fraudsters to carry out attacks through Stripe. Fraud Ops is responsible for developing and maintaining scalable processes related to fraud analysis, card testing, account takeover, and financial partner investigation requests. We strive to improve manual fraud decisioning and enhance support experiences for users impacted by fraud decisions, all while enabling healthy growth for the business. What you’ll do As a Payments Fraud Investigator, you will play a critical role in safeguarding our financial ecosystem by investigating high-risk accounts and identifying various forms of fraud. You will conduct deep-dive analyses of merchant accounts, lead cross-functional projects, and collaborate with stakeholders to enhance our fraud detection and prevention strategies at scale. Your expertise in fraud patterns and typologies will be essential in developing and enhancing investigative processes and programs. Responsibilities Analyze high risk accounts to identify fraudulent merchants, card testing, account takeovers, and other fraud vectors Lead root cause analyses to identify gaps in current systems, policies and strategies, and determine enhancements and process improvements to address emerging fraud risks through collaboration with key stakeholders Drive cross-functional projects aimed at refining operational processes and tools, enhancing the detection and management of fraudulent accounts across our global analyst network Investigate, mitigate, and remediate urgent fraud incidents, such as card testing and account takeover, and manage user responses to high-urgency distributed fraud attacks Communicate regular updates during team and organization-wide business reviews, summarize outcomes of complex investigations for executives, and deliver clear case determinations to users and partner financial institutions Travel to vendor locations to conduct analyst training sessions and knowledge-sharing initiatives, while identifying challenges and enhancing analyst performance to improve overall outcomes Who you are We’re looking for someone who meets the minimum requirements to be considered for the role. If you meet these requirements, you are encouraged to apply. The preferred qualifications are a bonus, not a requirement. Minimum Requirements 3+ years of experience conducting complex investigations 1+ years of experience leading risk-related projects and initiatives, collaborating effectively with cross-functional stakeholders Demonstrated ability to leverage data to propose solutions for both tactical and strategic challenges Proactive approach to challenging the status quo, with a willingness to question existing processes and advocate for improvements. User-centric perspective when addressing challenges, balanced with a pragmatic and solutions-oriented mindset Ability to travel to vendor locations for up to 10% of the year Preferred Qualifications Experience in payments, e-commerce, social media, or fintech, mitigating digital/card-not-present fraud Experience investigating and mitigating card testing and account takeover attacks Experience designing fraud/risk workflows, analyst tooling, and processes/procedural workflows Strong proficiency using SQL to analyze data, drive insights, and create dashboards and visualizations Working remotely at Stripe A remote location is defined as being 35 miles (56 kilometers) or more from one of our offices. While you would be welcome to come into the office for team/business meetings, on-sites, meet-ups, and events, our expectation is you would regularly work from home rather than a Stripe office. Stripe does not cover the cost of relocating to a remote location. We encourage you to apply for roles that match the location where you currently live or plan to live. Pay and benefits The annual US base salary range for this role is $88,900 - $133,400. For sales roles, the range provided is the role’s On Target Earnings (\"OTE\") range, meaning that the range includes both the sales commissions/sales bonuses target and annual base salary for the role. This salary range may be inclusive of several career levels at Stripe and will be narrowed during the interview process based on a number of factors, including the candidate’s experience, qualifications, and location. Applicants interested in this role and who are not located in the US may request the annual salary range for their location during the interview process. Additional benefits for this role may include: equity, company bonus or sales commissions/bonuses; 401(k) plan; medical, dental, and vision benefits; and wellness stipends.",
    "linkedin_job_id": "4333417566"
  },
  {
    "company_name": "Mercor",
    "linkedin_company_page": "https://www.linkedin.com/company/mercor-ai/life",
    "title": "Japanese Language Translator",
    "job_location": "Remote",
    "posted_date": "1 day ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Company Introduction Mercor connects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors include Benchmark, General Catalyst, Peter Thiel, Adam D'Angelo, Larry Summers, and Jack Dorsey. Role Overview Position: English–Japanese Translator/Interpreter – Contract, Remote Support real-time translation during sales and business meetings. Ensure smooth, accurate, and culturally appropriate communication. Responsibilities Provide simultaneous or consecutive translation during virtual or in-person business meetings. Translate both verbal discussions and written follow-ups such as chat messages, key points, or summary notes. Ensure professional tone and cultural sensitivity in all translations. Coordinate with internal stakeholders to understand context, terminology, and objectives. Maintain confidentiality and professionalism at all times. Requirements / Qualifications Must-Have Qualifications Proven experience as an interpreter or translator in corporate, sales, or client-facing environments. Native-level fluency in Japanese and English (both spoken and written). Strong understanding of business terminology, particularly in sales, partnerships, or technology. Excellent interpersonal and communication skills. Ability to think quickly and convey ideas accurately under time constraints. Availability for meeting scheduled on 10th October, 2025. Preferred Qualifications Prior experience translating for startups, tech firms, or multinational companies. Background in sales enablement, client success, or business development contexts. Familiarity with meeting platforms like Zoom, Google Meet, or MS Teams. Engagement Details Contract: Remote Schedule: Availability required on 10th October, 2025 Application Process (Takes 20-30 mins to complete) Upload resume AI interview based on your resume Submit form Resources & Support For details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcome For any help or support, reach out to: support@mercor.com PS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity. ,",
    "linkedin_job_id": "4334041053"
  },
  {
    "company_name": "ArcheSys Inc",
    "linkedin_company_page": "https://www.linkedin.com/company/archesys-inc/life",
    "title": "Full Stack Ruby on Rails Engineer",
    "job_location": "Baltimore, MD",
    "posted_date": "1 week ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Archesys is a technology firm specializing in innovative digital solutions and services for clients across various industries. We pride ourselves on our cutting-edge technologies, exceptional customer service, and collaborative work environment. We are seeking a highly skilled and motivated Full Stack Ruby on Rails Engineer to join our growing engineering team. In this role, you will play a key part in designing, developing, and maintaining web applications using Ruby on Rails. You will collaborate closely with product managers, designers, and other engineers in an agile environment to deliver high-quality software that meets our users' needs. This role demands a proactive problem-solver who can manage multiple projects while delivering high-quality solutions. The ideal candidate thrives in a collaborative, fast-paced environment and has experience building robust applications with modern tools and practices. This is a fully remote, full-time position. Responsibilities Design, build, and maintain scalable, secure, and high-performance web applications using Ruby on Rails. Collaborate with product managers, designers, and stakeholders to understand business requirements and translate them into technical solutions. Develop new features, enhance existing systems, and maintain code quality through code reviews, testing, and best practices. Participate actively in agile ceremonies (daily stand-ups, sprint planning, retrospectives) to align with product and engineering teams. Write clean, maintainable, and efficient code while following DRY and SOLID principles. Optimize application performance to ensure seamless user experience. Integrate third-party services, APIs, and microservices as needed. Work closely with DevOps and QA teams to ensure smooth deployment and continuous integration (CI/CD) processes. Mentor junior developers and provide technical guidance to the team. Stay up to date with the latest Ruby on Rails trends, tools, and industry best practices. Participate in code reviews and contribute to the improvement of our development processes. Collaborate effectively with cross-functional teams in an agile environment. Provide technical support and guidance to end-users. Educational Background: Bachelor's degree in Computer Science, Information Technology, Engineering or a related field. A Master's degree will be considered a plus. Experience: 5-10 years of professional experience with Ruby on Rails in a production environment. Strong understanding of MVC architecture and RESTful web services. Experience working with relational databases like PostgreSQL or MySQL, and ActiveRecord ORM. Familiarity with front-end technologies such as JavaScript, HTML, CSS, and frameworks like React.js or Vue.js. Proficient with agile methodologies (Scrum, Kanban) and tools such as JIRA and Confluence. Strong knowledge of API design and integration (GraphQL or REST). Hands-on experience with CI/CD pipelines and version control systems (Git/GitHub). Ability to write unit tests and integration tests using RSpec or Minitest. Knowledge of cloud platforms like AWS, Azure, or Google Cloud. Strong problem-solving skills and ability to work independently and within a team. Excellent communication and collaboration skills Experience working in an agile environment Passion for building high-quality software Technological Proficiency: Experience with cloud computing platforms such as AWS. Familiarity with modern programming languages and web technologies. Familiarity with agile tools such as Jira, Slack, and Confluence. Previous experience in healthcare, finance, or government sectors is advantageous. Experience with Docker, Kubernetes, or other containerization tools. Familiarity with Redis, Sidekiq, or background job processing. Exposure to microservices architecture and distributed systems. Experience working in a DevOps culture and with monitoring tools like New Relic or Datadog. Knowledge of GraphQL and API-first development. Stakeholder Communication: Foster open communication with stakeholders, providing regular updates on project status and milestones. Act as one of the point of contact between clients, stakeholders, and development teams. Communicate regularly with stakeholders, including product managers, executives, and customers, to keep them informed of progress and address any concerns. Cross-Functional Collaboration: Collaborate with various departments to ensure the seamless integration of technologies and solutions. Facilitate problem-solving sessions to address complex challenges and foster innovation. Personal Attributes: Strong leadership qualities, with the ability to collaborate effectively across cross-functional teams. Forward-thinking with a keen eye for identifying opportunities for innovation and improvement. Detail-oriented with a commitment to maintaining high standards of quality and efficiency. Additional Requirements: A willingness to continually learn and adapt to the evolving technology landscape. Ability to work in a fast-paced environment and manage multiple projects simultaneously. All work must be conducted within the U.S., excluding U.S. territories. Some federal contracts require U.S. citizenship to be eligible for employment. You must be legally authorized to work in the U.S. now and in the future without sponsorship. As the US Government is our clientele, you may be required to obtain a public trust or security clearance. Some of our available roles are on federal contracts that require a degree or additional years of experience as a substitute. What we offer: Competitive salary and benefits package, including health, dental, and vision insurance, retirement plan, and generous paid time off. Opportunity to work with a talented team of professionals on exciting and innovative projects. Flexible work arrangements, including remote work options. Continuous learning and development opportunities, including access to training resources and professional development programs. A collaborative, inclusive work environment that values diversity and encourages growth. Join us at Archesys and be part of a team dedicated to delivering cutting-edge cloud solutions for clients in the public sector. Your expertise and passion for technology will help us continue to innovate and grow. We look forward to welcoming you to our team and supporting your success as a Full Stack Ruby on Rails Engineer. Archesys participates in E-Verify. Upon hire, we will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S. Archesys is an equal opportunity employer committed to creating a diverse and inclusive workplace. We welcome applications from all qualified candidates, regardless of race, color, religion, sex. Work collaboratively with different departments to ensure seamless integration of technologies and solutions. Organize problem-solving sessions to tackle complex challenges and encourage innovation. Compensation Range: $100K - $120K",
    "linkedin_job_id": "4318298679"
  },
  {
    "company_name": "Lensa",
    "linkedin_company_page": "https://www.linkedin.com/company/lensa/life",
    "title": "Ruby on Rails Backend Developer (Remote Opportunity)",
    "job_location": "Remote",
    "posted_date": "Reposted 6 days ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Lensa is a career site that helps job seekers find great jobs in the US. We are not a staffing firm or agency. Lensa does not hire directly for these jobs, but promotes jobs on LinkedIn on behalf of its direct clients, recruitment ad agencies, and marketing partners. Lensa partners with DirectEmployers to promote this job for VetsEZ. Clicking \"Apply Now\" or \"Read more\" on Lensa redirects you to the job board/employer site. Any information collected there is subject to their terms and privacy notice. VetsEZ is seeking a Ruby on Rails Backend Developer to support backend development for Department of Veterans Affairs (VA) project. The ideal candidate will design and implement server-side components, APIs, and database integrations while ensuring compliance with software standards and testing requirements. This role will contribute to system planning, deployment, and analysis to deliver secure, high-quality solutions. The candidate must reside within the continental US. Responsibilities Develop and maintain backend components using Ruby on Rails, JSON controllers, Sidekiq, and RESTful APIs. Collaborate with cross-functional teams to gather requirements, plan sprints, and deliver high-quality solutions. Conduct backend system analysis, optimize performance, and support integration testing. Participate in code and sprint reviews, ensuring adherence to coding standards and compliance. Prepare and maintain technical documentation, reports, and operational procedures. Communicate proactively with stakeholders to ensure project alignment and timely issue resolution. Take on additional tasks and responsibilities as needed to support team objectives and ensure the success of the project. Requirements Bachelor's degree in Computer Science, Information Technology, or a related field. 3+ years of experience developing in Ruby on Rails and managing backend systems. Strong analytical and problem-solving skills with RSpec testing experience. Experience with Agile/Scrum methodologies and the software development lifecycle. Proficiency with code versioning and collaboration tools (e.g., GitHub, Jira, Confluence). Additional Qualifications Prior federal government experience preferred. Experience working with the VA or other federal agencies. Familiarity with VA.gov platform and government cloud hosting solutions. Proficiency in managing and optimizing RESTful APIs within federal environments. Experience with system integrations such as CorpDB, MPI, BDN, and VBMS. Ability to obtain a government clearance. Benefits Medical/Dental/Vision. 401k with Employer Match. PTO + Federal Holidays. Corporate Laptop. Training Opportunities. Remote Opportunity. Note: Selected candidates will be required to complete fingerprinting at a government facility and undergo a background check as part of the hiring process. VetsEZ is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, or protected veteran status. Sorry, we are unable to offer sponsorship at this time. If you have questions about this posting, please contact support@lensa.com",
    "linkedin_job_id": "4312024261"
  },
  {
    "company_name": "Paramount Financial Recruiting",
    "linkedin_company_page": "https://www.linkedin.com/company/paramount-financial-recruiting/life",
    "title": "Work from Home | No Experience Needed | $55K - $150K",
    "job_location": "Remote",
    "posted_date": "20 hours ago",
    "applicant_count": "Over 100 applicants",
    "salary": "Not specified",
    "description": "About the job 🔓Unlock Your Earning Potential: Join Us as a Remote Sales Representative Are you ready to take control of your income, schedule, and future? Our client is seeking driven, entrepreneurial individuals to join their high-performing remote sales team. This is your opportunity to build a rewarding career in financial services—on your terms 🚀Why You’ll Love This Opportunity: 🏆Award-Winning Culture Recognized by Entrepreneur Magazine for its top-tier company culture and praised by employees on Glassdoor and Indeed 📈Massive Growth Potential Featured on the Inc. 5000 for six straight years—this is a company on the rise, and you can rise with it. 🎓World-Class Training & Mentorship Access a proven training system, one-on-one mentorship from industry leaders, and support every step of the way. 💰Unlimited Earning Potential Most new reps earn $100K+ in year one, with top producers hitting $200K–$300K by year three. 🕒Total Flexibility Work remotely, set your own hours, and say goodbye to commuting and mandatory meetings. 💼What You’ll Do: Build Strong Client Relationships Guide and support clients as they explore life-changing financial solutions Lead Virtual Consultations Deliver professional, engaging presentations that demonstrate value and build trust Customize Financial Plans Help clients protect their future with products like Indexed Universal Life (IUL), annuities, and life insurance—tailored to their unique needs Close Sales with Confidence Work warm, pre-qualified leads—no cold calling—and exceed your personal sales goals. Stay Organized Track interactions and maintain accurate, compliant client records 🌟You Might Be a Fit If You're: A natural communicator who thrives on helping others Self-motivated, disciplined, and results-driven Energized by challenges and big goals Passionate about financial literacy and changing lives 💼What’s in It for You: 100% remote—work from anywhere Premium, vetted leads provided (no prospecting or cold calls!) Ongoing coaching, mentorship, and support Access to health & life insurance options The freedom of a 1099 position with uncapped commission 🚀Your Future Starts Here This isn’t just another sales job. It’s a launchpad for those who want to thrive personally and professionally while making a real impact. Ready to start earning what you're worth and living life on your terms? Apply now and take the first step toward a life of freedom, fulfillment, and financial success.",
    "linkedin_job_id": "4320652792"
  },
  {
    "company_name": "DevDocs",
    "linkedin_company_page": "https://www.linkedin.com/company/devdocs/life",
    "title": "Technical Translator (Remote, Developer-Focused Docs)",
    "job_location": "Austin, TX",
    "posted_date": "3 months ago",
    "applicant_count": "Over 100 applicants",
    "salary": "Not specified",
    "description": "About the job Get paid to sharpen technical translations! DevDocs is hiring freelance editors to polish developer-focused blogs. Flexible side work, remote, $50 per blog. DevDocs is looking for skilled editors to help us improve technical blogs translated by AI. This is part-time, flexible work, perfect for experienced translators, technical writers, or engineers who want to pick up a few hours of paid editing each week. You'll be editing developer-focused blogs, making sure the final translations are accurate, natural-sounding, and useful to real users. We're not just looking for proofreading—we need people who can catch where meaning gets lost and reshape translations to read like they were written natively. Each blog pays $50. Most assignments take about 1-3 hours to edit depending on complexity. You'll be able to accept work based on your availability, no set schedule. Requirements Native-level fluency in one or more of the following languages: Korean, Japanese, Dutch, French, German, Italian, Polish, Brazilian Portuguese, European Spanish, Latin American Spanish, Swedish, or Hebrew. Strong written English comprehension—source content is in English. Technical fluency: you're comfortable working with developer documentation, APIs, or software-related content. (You don't need to be a coder, but you should recognize when translation needs technical accuracy.) Experience editing translations or technical documents preferred. Able to revise machine-translated text into natural, clear, and contextually appropriate writing. Comfort with basic file formats: Markdown, Google Docs, Word documents, etc. Detail-oriented mindset: You notice where meaning gets subtly lost, not just where a sentence sounds \"off.\"",
    "linkedin_job_id": "4283765891"
  },
  {
    "company_name": "Tenjin",
    "linkedin_company_page": "https://www.linkedin.com/company/tenjin/life",
    "title": "Senior Full-Stack Ruby on Rails Engineer",
    "job_location": "Remote",
    "posted_date": "2 months ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Description We’re looking for a Senior Full-Stack Ruby on Rails Engineer to lead development of our analytics dashboard. You’ll design, build, and maintain Rails APIs, background jobs, and database schemas that power data-rich React components and interfaces. You’ll work closely with product managers, designers, front-end developers, and infrastructure to rapidly push new features from ideation to production. This is a hands-on role with plenty of scope to influence architecture, user experience, and coding standards. While we’re targeting senior engineers, we’re open to strong mid-level candidates who demonstrate leadership, ownership, and a passion for full-stack craftsmanship. Team, Culture, and Product We're a small engineering team looking to grow. We're a remote-only organization with most of the engineering team working from US timezones. We aim to help mobile app developers make data-driven decisions about their marketing in a secure, privacy-centric, user-friendly way. We encourage flexibility in working locations and hours but also make sure we all overlap at least briefly for a bit each day. Responsibilities Lead major architecture and software design decisions Develop and maintain background jobs (Sidekiq) and employ caching to keep dashboards snappy under load Own CI/CD pipelines and deployments (GitHub Actions, Docker, Kubernetes/ECS), ensuring that releases are automated, reliable, and fast Collaborate closely with designers, product managers, and front-end developers to create user-friendly and visually appealing interfaces Write clear and maintainable documentation Ensure test coverage for new and existing features using RSpec and Jest Employ feature flags to support trunk-based development workflows Adhere to and enforce code style guidelines and best practices Profile, debug, and optimize both front-end and back-end performance issues in production and staging environments Requirements Deep expertise in Ruby on Rails (typically 5+ years) Proficiency in ReactJS (typically 3+ years), along with a strong foundation in JavaScript, TypeScript Experience integrating front-end components with Ruby on Rails backends Experience building and consuming REST APIs Familiarity with Git and hosting platforms like GitHub Excellent organization and communication skills An appetite for learning, problem-solving, and contributing to a dynamic team environment Nice-to-haves Experience with AWS, Kubernetes, and Docker Experience with Ruby outside of a Rails context (such as Sinatra) Experience with PostgreSQL Experience with advanced topics in React such as the Context Api, Memoization and Virtualization Experience with mobile app development or mobile marketing Experience building data-intensive user workflows - customizable tables, charts, etc Experience working with in-house style guides Benefits Annual budget for learning and personal development (conferences, books, classes, etc) Budget for fitness and well-being activities (gym memberships, fitness equipment) Unlimited vacation days and a vacation stipend to make sure you take time off (we recommend at least 20 days off per year) Team off-sites and other get-togethers Health Care Plan (Medical, Dental & Vision) Family Leave (Maternity, Paternity)",
    "linkedin_job_id": "4293872723"
  },
  {
    "company_name": "Stride",
    "linkedin_company_page": "https://www.linkedin.com/company/stride-build/life",
    "title": "Ruby on Rails Developer",
    "job_location": "Remote",
    "posted_date": "1 week ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job User Trust Squad The squad that makes sure users and regulators trust our systems. They own the integration of KYC controls, provide backend tools to help Operations manage compliance, risk, and fraud. They provide user-facing security features across all applications. Technical Responsibilities Architecture & Development: Design and build scalable web applications using Ruby on Rails and React. Drive technical architecture decisions and establish coding patterns for maintainable, high-quality software. Project Leadership: Lead technical initiatives from discovery through deployment. Scope requirements, evaluate approaches, and coordinate implementation across teams. Quality Assurance: Implement automated testing strategies and maintain code quality through test-driven development practices. Collaboration: Work with cross-functional teams to deliver integrated solutions. Facilitate technical discussions and drive consensus across engineering, product, and business stakeholders. Required Technical Skills Backend Development: Proficiency in server-side languages (Ruby, Python, Java, C#, or C++). Experience with Ruby on Rails, MVC frameworks, and RESTful API design. Frontend Development: Strong experience with modern JavaScript frameworks, particularly React. Ability to build responsive, interactive interfaces with clean component architecture. System Design: Understanding of web application architecture, design patterns, and managing technical complexity. Capable of making informed decisions about system structure. Testing & Quality: Commitment to automated testing as core practice. Experience with unit, integration, and end-to-end testing frameworks. Technical Leadership: Experience leading technical projects through all development phases. Skilled at gathering requirements and building technical consensus. Mentorship: Track record of developing engineering talent through code reviews, pair programming, and technical mentorship. Additional Requirements: Knowledge of Authentication, OAuth integration would be helpful. Work Environment Thrive in a fast-paced startup environment where pragmatic engineering and agile methodologies drive development. We value shipping quality products through smart tradeoffs, clean code, and lean engineering principles. Our culture emphasizes transparency, continuous learning, and collaborative problem-solving.",
    "linkedin_job_id": "4318524752"
  },
  {
    "company_name": "Zscaler",
    "linkedin_company_page": "https://www.linkedin.com/company/zscaler/life",
    "title": "Senior Software Engineer (Ruby/Rails)",
    "job_location": "Remote",
    "posted_date": "Reposted 1 day ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job About Zscaler Serving thousands of enterprise customers around the world including 45% of Fortune 500 companies, Zscaler (NASDAQ: ZS) was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. As the operator of the world’s largest security cloud, Zscaler accelerates digital transformation so enterprises can be more agile, efficient, resilient, and secure. The pioneering, AI-powered Zscaler Zero Trust Exchange™ platform, which is found in our SASE and SSE offerings, protects thousands of enterprise customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location. Named a Best Workplace in Technology by Fortune and others, Zscaler fosters an inclusive and supportive culture that is home to some of the brightest minds in the industry. If you thrive in an environment that is fast-paced and collaborative, and you are passionate about building and innovating for the greater good, come make your next move with Zscaler. The Red Canary engineering team at Zscaler builds and operates the platform and products that deliver unmatched threat detection and response! We process billions of events per day from hundreds of thousands of systems worldwide. Every engineer is empowered to make a difference for our customers with unique opportunities to learn new technology and tackle the hardest problems in cyber security. Responsibilities We are searching for a Senior Software Engineer to join us in building the Red Canary platform and its supporting products. Reporting to the Manager of Software Engineering, you'll be responsible for: Continuously shipping quality product by writing well organized, testable and high performing code Addressing system and software bugs, developing product enhancements, and launching new features to scale within a Product Team construct Supporting products and applications that operate in a 24x7 production environment, including participating in an on call rotation Writing clear and concise documentation; share knowledge internally and across teams Helping identify technical risk and mitigation plans Collaborating with Product Management and Design teams taking small to medium features from concept to shipping as the sole programmer What We're Looking For (Minimum Qualifications) 4+ years of experience shipping high-quality SaaS products and features with experience in taking ownership of a product or feature from concept to launch Experienced with Ruby on Rails (or similar web application technologies) and other common libraries such as RSpec and Sidekiq Experience with React, HAML, Redis, Postgres, AWS, Docker or a combination of similar tech Confidence making architectural design decisions that improve scalability and performance for high-volume background tasks Software testing skills to ensure we deliver the highest quality products that delight customers What Will Make You Stand Out (Preferred Qualifications) Knowledge of operating cloud-based relational databases (Postgres, etc) at scale, including replication, monitoring and optimization Experience in any field in security such as security product development, malware handling or processing, security operations workflows, etc. #LI-DB1 Zscaler’s salary ranges are benchmarked and are determined by role and level. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations and could be higher or lower based on a multitude of factors, including job-related skills, experience, and relevant education or training. The base salary range listed for this full-time position excludes commission/ bonus/ equity (if applicable) + benefits. Base Pay Range $119,000 - $170,000 USD At Zscaler, we are committed to building a team that reflects the communities we serve and the customers we work with. We foster an inclusive environment that values all backgrounds and perspectives, emphasizing collaboration and belonging. Join us in our mission to make doing business seamless and secure. Benefits Our Benefits program is one of the most important ways we support our employees. Zscaler proudly offers comprehensive and inclusive benefits to meet the diverse needs of our employees and their families throughout their life stages, including: Various health plans Time off plans for vacation and sick time Parental leave options Retirement options Education reimbursement In-office perks, and more! Learn more about Zscaler’s Future of Work strategy, hybrid working model, and benefits here. By applying for this role, you adhere to applicable laws, regulations, and Zscaler policies, including those related to security and privacy standards and guidelines. Zscaler is committed to providing equal employment opportunities to all individuals. We strive to create a workplace where employees are treated with respect and have the chance to succeed. All qualified applicants will be considered for employment without regard to race, color, religion, sex (including pregnancy or related medical conditions), age, national origin, sexual orientation, gender identity or expression, genetic information, disability status, protected veteran status, or any other characteristic protected by federal, state, or local laws. See more information by clicking on the Know Your Rights: Workplace Discrimination is Illegal link. Pay Transparency Zscaler complies with all applicable federal, state, and local pay transparency rules. Zscaler is committed to providing reasonable support (called accommodations or adjustments) in our recruiting processes for candidates who are differently abled, have long term conditions, mental health conditions or sincerely held religious beliefs, or who are neurodivergent or require pregnancy-related support.",
    "linkedin_job_id": "4304186477"
  },
  {
    "company_name": "ExecutivePlacements.com",
    "linkedin_company_page": "https://www.linkedin.com/company/executive-placements/life",
    "title": "Junior/Entry Level Coder - Remote",
    "job_location": "Denver, CO",
    "posted_date": "Denver, CO · 1 hour ago · 12 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Synergisticit Partnership Are you passionate about coding or technology and ready to make your mark in tech? For more than 14 years, SynergisticIT has been helping aspiring developers like you excel in the tech industry. We focus on equipping you with the skills and experience needed to not only secure a job but to thrive in your career! Customized inputs to achieve the desired outcomes.",
    "linkedin_job_id": "4334206019"
  },
  {
    "company_name": "Braintrust",
    "linkedin_company_page": "https://www.linkedin.com/company/usebraintrust/life",
    "title": "AI Evaluator / Annotator (Remote- freelance, 100+ openings)",
    "job_location": "Remote",
    "posted_date": "1 week ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Job Description Position Overview: iMerit seeks detail-oriented and analytically minded Multimodal GenAI Evaluation Analysts to perform highly nuanced evaluations of AI system outputs across different modalities: text, image, video, and multimodal interactions. Analysts will assess the accuracy, appropriateness, quality, clarity, and cultural alignment of model outputs against complex guidelines, ensuring that results align with project standards and real-world use cases. These evaluations will directly inform the development and fine-tuning of advanced large language models (LLMs), vision models (LVMs), and multimodal AI systems. Role Responsibilities: Evaluate outputs generated by LLMs across multiple modalities (text, image captions, video descriptions, and multimodal prompts). Assess quality against project-specific criteria such as correctness, coherence, completeness, style, cultural appropriateness, and safety. Identify subtle errors, hallucinations, or biases in AI responses. Apply domain expertise and logical reasoning to resolve ambiguous or unclear outputs. Provide detailed written feedback, tagging, and scoring of outputs to ensure consistency across the evaluation team. Escalate unclear cases and contribute to refining evaluation guidelines. Collaborate with Project Managers and Quality Leads to meet accuracy, reliability, and turnaround benchmarks. Skills & Competencies: Strong critical reading, observational, and evaluative skills across different modalities. Ability to articulate nuanced judgments with precision and clarity. Excellent English comprehension (CEFR B2 or above); additional languages a plus. Familiarity with LLMs, generative AI, and multimodal systems. Strong attention to detail and ability to apply guidelines consistently. Awareness of cultural and linguistic nuances, including potential bias and harm in AI outputs. Comfort with evolving workflows, rapid feedback cycles, and complex quality frameworks. Requirements: Bachelor's degree/ diploma or equivalent educational qualification. 1+ years of experience in data annotation, LLM evaluation, content moderation, or related AI/ML domains. Demonstrated experience working with data annotation tools and software platforms. Strong understanding of language and multimodal communication (instruction following in image generation, fact-checking, narrative coherence in video, etc.). Ability to adapt quickly to changing project directions and fast-paced work environments. Previous experience creating or annotating complex data specifically for Large Language Model (LLM) training. Prior exposure to generative AI, prompt engineering, or LLM fine-tuning workflows is a plus. While moderation of high-harm/high-risk material is not part of this role, candidates should be aware that occasional exposure to NSFW or otherwise sensitive content may occur due to imperfections in client-provided datasets. Applicants should indicate that they are comfortable working in environments where such incidental exposure is a possibility. What We Offer: Opportunities to shape the evaluation standards for next-generation multimodal AI systems. Innovative and supportive global working environment. Competitive compensation and flexible remote working arrangements. Continuous learning and growth in applied AI evaluation. Please acknowledge that you agree to the selection process below: You will receive an iMerit platform assessment (15–30 minutes). If successfully completed, you’ll be invited to join the first project. After onboarding, once you’ve completed 10 hours of work, a quality test will be conducted. If you pass the quality test, you’ll continue on a 3-month project and will be invited to participate in upcoming projects. Note: You will complete a quick 15–30 minute assessment. This requires downloading a browser extension, which can be removed once the assessment is completed. ID verification and background check are required. Onboarding will be completed through iMerit’s platform. For Digital Nomads: If you are currently traveling, please let us know. This ensures any discrepancies between your current location and your work authorization location do not affect your application. Commitment: Minimum 20 hours per week (flexible schedule). You may work more hours if desired. Hourly rates: Malaysia – $5/hr Mexico, Colombia, Brazil, Costa Rica – $8.50/hr Argentina, Poland, Bulgaria, Romania, Malta, Latvia, Lithuania, UAE – $13/hr Portugal, Italy, Greece, Spain – $15.50/hr Canada, Australia, New Zealand, United Kingdom, Ireland, US, Finland, France, Sweden, Belgium, Austria, Denmark, Germany, Luxembourg, Estonia – $22/hr",
    "linkedin_job_id": "4319502832"
  },
  {
    "company_name": "xAI",
    "linkedin_company_page": "https://www.linkedin.com/company/xai/life",
    "title": "Multilingual Tutor",
    "job_location": "Remote",
    "posted_date": "Reposted 3 weeks ago",
    "applicant_count": "Over 100 applicants",
    "salary": "Not specified",
    "description": "About the job About xAI xAI’s mission is to create AI systems that can accurately understand the universe and aid humanity in its pursuit of knowledge. Our team is small, highly motivated, and focused on engineering excellence. This organization is for individuals who appreciate challenging themselves and thrive on curiosity. We operate with a flat organizational structure. All employees are expected to be hands-on and to contribute directly to the company’s mission. Leadership is given to those who show initiative and consistently deliver excellence. Work ethic and strong prioritization skills are important. All engineers are expected to have strong communication skills. They should be able to concisely and accurately share knowledge with their teammates. About the Role As an AI Tutor specialized in multilingual capabilities, you will contribute to xAI's mission by training and refining Grok to handle diverse languages with accuracy and cultural nuance. Your work will directly impact Grok's global accessibility, enabling seamless interactions for users worldwide, bridging language barriers, and enhancing the AI's understanding of multilingual contexts through targeted annotations and data curation. Responsibilities You will use proprietary software to provide labels, annotations, and inputs on projects involving multilingual text, translations, and cultural adaptations. You must support the delivery of high-quality curated data that ensures accurate language representation and contextual fidelity. In this effort, you will collaborate with technical staff to develop tasks that improve AI's ability to process and generate content in multiple languages. You’ll also work with technical staff to improve annotation tools for efficient workflows. Required Qualifications Demonstrated high proficiency in English, with strong reading, writing, and comprehension skills. High fluency in at least one of the following languages: Chinese (Simplified), Spanish, German, French, Arabic (Khaleeji), Italian, Portuguese or Hindi. Demonstrated ability to handle multilingual content, including translation accuracy, cultural sensitivity, and contextual interpretation. Strong comprehension skills and the ability to make independent judgments on ambiguous or limited multilingual material. Strong ability to navigate information resources, databases, and online sources in multiple languages for verification and analysis. Strong communication, interpersonal, analytical, and organizational skills. Commitment to developing AI that supports inclusive, multilingual intelligence. Preferred Qualifications Experience in translation, linguistics, content localization, or roles involving multilingual data annotation. Location & Other Expectations This position is based in Palo Alto, CA, or fully remote. The Palo Alto option is an in-office role requiring 5 days per week; remote positions require strong self-motivation. If you are based in the US, please note we are unable to hire in the states of Wyoming and Illinois at this time. We are unable to provide visa sponsorship. Team members are expected to work from 9:00am - 5:30pm PST for the first two weeks of training and 9:00am - 5:30pm in their own timezone thereafter. For those who will be working from a personal device, please note your computer must be a Chromebook, Mac with MacOS 11.0 or later, or Windows 10 or later. You must own and have reliable access to a smartphone. Compensation $45/hour - $100/hour The posted pay range is intended for U.S.-based candidates and depends on factors including relevant experience, skills, education, geographic location, and qualifications. For international candidates, our recruiting team can provide an estimated pay range for your location. Benefits: Hourly pay is just one part of our total rewards package at xAI. Specific benefits vary by country, depending on your country of residence you may have access to medical benefits. We do not offer benefits for part-time roles. xAI is an equal opportunity employer. California Consumer Privacy Act (CCPA) Notice",
    "linkedin_job_id": "4305142766"
  },
  {
    "company_name": "Stealth Startup",
    "linkedin_company_page": "https://www.linkedin.com/company/stealth-startupsssss/life",
    "title": "Senior Ruby on Rails Engineer Cofounder – Stanford Startup with Excellent Traction",
    "job_location": "San Francisco, CA",
    "posted_date": "1 day ago",
    "applicant_count": "68 applicants",
    "salary": "Not specified",
    "description": "About the job We’re a fast-growing Stanford-founded startup with strong early traction looking for a Senior Ruby on Rails Engineer to join as a cofounder. You’ll take ownership of our product architecture and build scalable backend systems to support rapid growth. Responsibilities: Lead backend development using Ruby on Rails Collaborate with the founding team on product design and technical strategy Optimize performance, security, and scalability Mentor junior engineers and help define engineering best practices Requirements: 5+ years of experience in Ruby on Rails development Strong understanding of relational databases and API design Experience with scaling web applications and cloud infrastructure Entrepreneurial mindset and excitement for early-stage startups",
    "linkedin_job_id": "4337362107"
  },
  {
    "company_name": "Truelogic Software",
    "linkedin_company_page": "https://www.linkedin.com/company/truelogicsoftware/life",
    "title": "Senior Ruby Developer - Travel",
    "job_location": "Remote",
    "posted_date": "6 days ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job About Truelogic At Truelogic, we are a leading provider of nearshore staff augmentation services headquartered in New York. For over two decades, we’ve been delivering top-tier technology solutions to companies of all sizes, from innovative startups to industry leaders, helping them achieve their digital transformation goals. Our team of 600+ highly skilled tech professionals drives digital disruption by partnering with U.S. companies on their most impactful projects. Whether collaborating with Fortune 500 giants or scaling startups, we deliver results that make a difference. By applying for this position, you’re taking the first step in joining a dynamic team that values your expertise and aspirations. We aim to align your skills with opportunities that foster exceptional career growth and success while contributing to transformative projects that shape the future. Our Client This company is completely redefining what it means to be a guest at a hotel. By offering day access to luxury hotel experiences, including breathtaking pools, private beaches, deluxe spas, and more, it allows people to escape – without ever having to leave town. If you’re moved to contribute to our vision, we’d love your help. Our growing team of innovative tech and hospitality experts has partnered with over 1,500 leading hotels and resorts. Job Summary We are seeking a seasoned Software Engineer to join our Marketplace Core team. This team is responsible for building our core product on iOS and Android. You will work with the Product, Design, and Data cross-functional partners to build delightful products for our customers and resort partners that are highly performant—both in terms of site metrics and business KPIS. We are looking for someone located in or near the NYC area, as this role will be in-person at our NYC headquarters 4 days a week. Responsibilities Lead and execute on our ambitious roadmap, releasing milestone products that will carry the company to its next phase Along with senior technical leadership, push the team’s culture towards maturity while staying stage appropriate Be part of the on-call rotation supporting any business-critical outages in the off-hours We are versatile technologists currently developing on AWS using a stack that consists of Ruby-on-Rails, NodeJS, Postgres, MongoDB, and ECS Qualifications And Job Requirements We encourage candidates to apply even if they don’t have 100% of the qualifications below. We believe in a holistic approach when evaluating talent for our team and post new roles often, so even if this role isn’t quite right, we want to meet you! You have worked professionally with Ruby on Rails for 6+ years You have experience working on high-scale applications You have developed high-scale applications on relational and non-relational databases You have a proven track record of building applications that maintain a high bar of quality You are an empathetic communicator who can work seamlessly with technical and non-technical stakeholders You are passionate about a great product that delights the customers while delivering business value You're a good person. While building a startup is hard, being a good person is not. We are creating a culture of people with whom you would look forward to working. While we offer incredible experiences to our guests, it is just as important to us to foster an incredible culture for our employees. What we offer $180,000 - $200,000 per year, plus equity, commensurate with experience. Health, Dental & Vision — We're deeply invested in the health and well-being of our team and are proud to contribute to the monthly premiums of these insurance plans. Stock Option Plan — We offer employees the opportunity to become part-owners in our mission. Let’s redefine what it means to be a guest, together. 401k plan — Save for your future with a 401k plan offering. Unlimited Paid Time Off (PTO) — Enjoy life away from work to be inspired and fully recharge with unlimited paid time off. Paid maternity leave Annual Hotels credit — Our mission is to bring delight and relaxation to people around the world, including our employees! Access private beaches, deluxe saunas, awesome pools, and much more with your annual credit. Work with Top American Companies: Grow your expertise working on innovative, high-impact projects with Industry-Leading U.S. Companies. Apply now!",
    "linkedin_job_id": "4333111057"
  },
  {
    "company_name": "Anytime Fitness",
    "linkedin_company_page": "https://www.linkedin.com/company/anytime-fitness/life",
    "title": "Fitness Club Data Entry Clerk",
    "job_location": "Remote",
    "posted_date": "1 day ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job This is a remote position. Anytime Fitness is the healthiest franchise opportunity on the planet. As the fastest-growing fitness franchise in the world, Anytime Fitness helps more than three million members in more than three thousand gyms around the globe get to a healthier place. Recently honored as the world’s “Top Global Franchise” by Entrepreneur magazine, Anytime Fitness offers entrepreneurs a convenient and affordable recurring-revenue business model. Franchisees enjoy the luxury of being their own boss, and are given the resources and support to achieve a healthy work/life balance. Anytime Fitness is the perfect fit for entrepreneurs seeking the opportunity to run a business that has the potential to make a profound difference in people’s lives. The Remote Data Entry Clerk supports Anytime Fitness club operations by accurately inputting, maintaining, and updating data related to membership records, billing, attendance, employee information, and performance metrics. This position plays a key role in ensuring that the club’s administrative systems are up-to-date, organized, and compliant with company policies. The ideal candidate is detail-oriented, tech-savvy, and able to manage high volumes of data efficiently in a remote environment. Key Responsibilities Data Management & Entry Input and update membership information, billing details, and contract data into club management software (e.g., Club OS, Mindbody, or other CRM systems). Enter daily, weekly, and monthly performance reports accurately. Maintain and update employee records, schedules, and timesheets as assigned. Track and verify payments, renewals, and cancellation for accuracy. Ensure data integrity by performing regular audits and cross-checks. Administrative Support Assist with generating reports for management on membership trends, sales, and retention. Support remote operations staff with clerical and data-related tasks. Organize and maintain digital files in accordance with Anytime Fitness policies. Communicate with club managers to clarify or correct data inconsistencies. Compliance & Confidentiality Handle all member and employee data securely and in compliance with data protection regulations. Follow company procedures for document management and data retention. Report discrepancies or data issues to management promptly. Requirements Education & Experience: High school diploma or equivalent required; associate’s degree or coursework in business administration preferred. 1–2 years of data entry, administrative, or clerical experience (remote experience preferred). Experience in the fitness or service industry is a plus. Skills & Competencies: Strong typing and data entry accuracy skills. Excellent attention to detail and organizational abilities. Proficiency in Microsoft Excel, Google Sheets, and database management software. Ability to work independently, manage time effectively, and meet deadlines. Strong communication and problem-solving skills. Familiarity with fitness club management software is an advantage. Benefits Competitive hourly pay or salary, depending on experience. Benefits may include paid time off, health insurance, and complimentary Anytime Fitness membership (depending on franchise or corporate policy). Opportunities for growth within club operations or corporate administration. Desired Skills and Experience Education & Experience: Bachelor’s degree in Business Administration, Sports Management, or related field (preferred). 3–5 years of experience in fitness club or hospitality management. Proven track record in sales, operations, and team leadership. Skills & Competencies: Strong leadership and interpersonal skills. Excellent communication and problem-solving abilities. Knowledge of fitness industry trends, equipment, and best practices. Proficiency in CRM and club management software. Ability to manage budgets and analyze performance metrics. Working Conditions Full-time position; may require evening and weekend availability. Fast-paced environment with frequent interaction with staff and members.",
    "linkedin_job_id": "4320622998"
  },
  {
    "company_name": "Jerry",
    "linkedin_company_page": "https://www.linkedin.com/company/jerryinc/life",
    "title": "Software Engineer I (entry)",
    "job_location": "Palo Alto, CA",
    "posted_date": "1 day ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job 👋 Hi there! If you're looking to make a real-world impact fast while leveling up your skills in a high-growth startup, we might be the right place for you! 🚗 Why join Jerry? We’re Jerry, and we’re building the first AI-powered AllCar™ app to completely rethink what it means to own a car. Car insurance, maintenance, repairs, financing—we’re simplifying it all into one seamless mobile experience. Our users already save over $1,000/year with us, and we’ve grown revenue 60x in the last 5 years. Now we’re scaling from 5M to 50M users, and we need sharp, curious engineers located in the SF area to help us get there. 🌟 Here’s What You’ll Get ✅ Impact from Day One — you’ll be writing production code within your first few weeks. ✅ Backed and booming — we’ve raised $240M+ and are cash-flow positive. ✅ Modern tech stack — React, Node, Python, AWS, TypeScript, and more. ✅ Mentorship + learning — work with top engineers from companies like Nvidia, TikTok, and Cepton. ✅ Merit-based growth — no seniority theater here. You grow fast if you deliver and learn fast. 🫵 What you’ll be working on You’ll join one of our engineering pods (core app, retention, automation) depending on your interests and skills. Every team ships regularly, works closely with product, and contributes to a mission that matters. We don’t expect you to know everything on day one, but we do expect: A love for learning Comfort with ambiguity Hustle and curiosity Pride in building high-quality, user-first software 💻 Our Stack Frontend: React, React Native Backend: NodeJS + TypeScript Infra: AWS, Go, Python, Docker, CI/CD Data: Redis, Postgres, DynamoDB, Clickhouse AI/ML: Python pipelines, LLM integrations, internal models You don’t need to know it all—but if some of that excites you, let’s talk. 🚀 What We’re Looking For Bachelor’s degree in Computer Science, Engineering, or a related field Internship, co-op, or side project experience is a plus—but not required Eagerness to learn, build, and grow While we appreciate your interest and application, only applicants under consideration will be contacted. Jerry.ai is proud to be an Equal Employment Opportunity employer. We prohibit discrimination based on race, religion, color, national origin, sex, pregnancy, reproductive health decisions or related medical conditions, sexual orientation, gender identity, gender expression, age, veteran status, disability, genetic information, or other characteristics protected by applicable local, state or federal laws. Jerry.ai is committed to providing reasonable accommodations for individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, please contact us at recruiting@jerry.ai The successful candidate’s starting pay will fall within the pay range listed on this job posting, determined based on job-related factors including, but not limited to, skills, experience, qualifications, work location, and market conditions. Ranges are market-dependent and may be modified in the future. In addition to base salary, the compensation may include opportunities for equity grants. We offer a comprehensive benefits package to regular employees, including health, dental, and vision coverage, paid time off, paid parental leave, 401(K) plan with employer matching, and wellness benefits, among others. Equity opportunities may also be part of your total rewards package. Part-time, contract, or freelance roles may not be eligible for certain benefits. About Jerry.ai Jerry.ai is America’s first and only super app to radically simplify car ownership. We are redefining how people manage owning a car, one of their most expensive and time-consuming assets. Backed by artificial intelligence and machine learning, Jerry.ai simplifies and automates owning and maintaining a car while providing personalized services for all car owners' needs. We spend every day innovating and improving our AI-powered app to provide the best possible experience for our customers. From car insurance and financing to maintenance and safety, Jerry.ai does it all. We are the #1 rated and most downloaded app in our category with a 4.7 star rating in the App Store. We have more than 5 million customers — and we’re just getting started. Jerry.ai was founded in 2017 by serial entrepreneurs and has raised more than $240 million in financing. Join our team and work with passionate, curious and egoless people who love solving real-world problems. Help us build a revolutionary product that’s disrupting a massive market.",
    "linkedin_job_id": "4337353690"
  },
  {
    "company_name": "Crossing Hurdles",
    "linkedin_company_page": "https://www.linkedin.com/company/crossinghurdles/life",
    "title": "Email Specialist | $90/hr Remote",
    "job_location": "Remote",
    "posted_date": "2 days ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job At Crossing Hurdles, we work as a referral partner. We refer candidates to our partner that collaborates with world’s leading AI research labs to build and train cutting-edge AI models. Position: Email Specialist Type: Hourly Contract Compensation: $50–$90/hour Location: Remote Commitment: 10–40 hours/week Role Responsibilities (Training support will be provided) Assist in AI training workflows by working directly within a Gmail client. Follow structured processes with strong attention to detail to ensure accuracy in email-related tasks. Work with digital tools and interfaces, including Gmail, to perform data-related tasks. Provide support for AI system development by annotating, processing, or verifying email data and content. Collaborate remotely with cross-functional teams and adapt to evolving workflows. Light familiarity with JSON or structured data formats is helpful but not required. Requirements Strong attention to detail and ability to follow structured processes. Comfort working with digital tools, especially Gmail (digital native profile). Background in STEM or technical disciplines (undergraduates, master's students, or digitally skilled professionals encouraged). Familiarity with JSON or structured data formats is a plus, but not necessary. A generalist mindset with adaptability to evolving workflows and processes. Application process: (Takes 20 min) Upload resume AI interview based on your resume (15 min) Submit form",
    "linkedin_job_id": "4333695878"
  },
  {
    "company_name": "Amivero",
    "linkedin_company_page": "https://www.linkedin.com/company/amivero/life",
    "title": "Sr. Ruby Developer",
    "job_location": "Remote",
    "posted_date": "1 week ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job The Amivero Team Amivero’s team of IT professionals delivers digital services that elevate the federal government, whether national security or improved government services. Our human-centered, data-driven approach is focused on truly understanding the environment and the challenge and reimagining with our customer how outcomes can be achieved. Our team of technologists leverage modern, agile methods to design and develop equitable, accessible, and innovative data and software services that impact hundreds of millions of people. As a member of the Amivero team you will use your empathy for a customer’s situation, your passion for service, your energy for solutioning, and your bias towards action to bring modernization to very important, mission-critical, and public service government IT systems. Special Requirements US Citizenship Required to obtain Public Trust Active DHS Public Trust preferred 5 year of relevant experience The GIST The Developer III will leverage a deep understanding of Ruby and related frameworks to design, build, and maintain high-quality applications in a collaborative Agile/DevSecOps environment. You’ll work with a team of software engineers, test automation engineers, designers, and product owners to bring conceptual solutions to life while balancing prioritization, risk management, and scope. This role involves developing new functionality for product releases, integrating across various application teams and technology stacks, and ensuring all solutions align with human-centered design principles and co-created user experiences. Collaborating with software engineers, designers, and product owners to translate user needs and concepts into functional Ruby applications. Writing clean, efficient, and maintainable Ruby code while adhering to Agile and DevSecOps best practices. Developing and enhancing product features to support new releases and improve overall system functionality. Conducting code reviews, debugging, and performance tuning to ensure high-quality and reliable software delivery. Partnering with test automation engineers to validate new functionality and maintain continuous integration pipelines. Engaging with cross-functional teams to align on priorities, manage risks, and define technical scope for upcoming sprints. Applying human-centered design principles to create intuitive, accessible, and user-focused experiences. Supporting multiple technology stacks and application teams to deliver innovative, secure, and scalable client solutions. Ensure alignment of team member activities with the goals of the program Mentor and develop UI/UX team member skillsets to continuously improve program delivery Serve as the escalation point for team member issues that need to be discussed with the Amivero Account Manager Escalate issues to the Amivero Account Manager Coordinate with the Amivero Account Manager to onboard new team members and provide training in their functional area U.S. Citizenship is required to obtain a Public Trust clearance. Active DHS Public Trust clearance is highly preferred. At least 5 years of relevant software development experience, ideally working with Ruby on Rails and related frameworks. Experience with relational databases (e.g., PostgreSQL, MySQL, etc.). Experience with modern front-end frameworks Experience with containerization (Docker), or infrastructure as code (Terraform, etc.). Solid understanding of Agile and DevSecOps methodologies, with hands-on experience collaborating in cross-functional teams. Strong problem-solving and analytical skills, with the ability to manage multiple priorities in a fast-paced environment. Commitment to delivering human-centered, secure, and scalable solutions that align with client needs and organizational goals. EOE/M/F/VET/DISABLED All qualified applicants will receive consideration without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. Amivero complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities.",
    "linkedin_job_id": "4318621406"
  },
  {
    "company_name": "Oxley Enterprises, Inc.",
    "linkedin_company_page": "https://www.linkedin.com/company/oxley-enterprises%E9%80%9F-inc-/life",
    "title": "Junior Developer (Remote)",
    "job_location": "Stafford, VA",
    "posted_date": "5 days ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job The following states/districts are excluded from this job ad: AK, CA, CO, CT, DC, HI, IL, LA, MA, MN, MO, NE, NV, NH, NJ, NM, NY, ND, OR, PR, RI, VT, WA, WY Location: Remote in any United States jurisdiction not excluded from this job advertisement Position Description: The Junior Developer maintains front-end and back-end applications and is responsible for code development and maintenance in an Agile environment. Minimum/General Experience: 1 year of professional software development experience Minimum Education: Bachelor's degree in computer science, Management Information Systems, or other related field Essential Skills/Qualifications Experience with MUMPs, Delphi, Java, JavaScript, Python, C, C++, .NET, and/or Ruby on Rails software development Experience with software development frameworks (e.g., Spring, Spring Boot, React, PyTorch, JUnit, Jest) Knowledge of Integrated Development Environments (e.g., Delphi, Eclipse, Visual Studio, VSCode, IntelliJ, JetBrains) Understanding of modern software design and development methodologies (e.g., Agile, OO) Understanding of a full release project life cycle Above average ability to consistently apply quality and security standards Above average ability to work effectively in a team and with clients Above average verbal and written communication skills General Physical Requirements needed to perform the essential functions of this job may vary based on the location of the assignment. Assignment Location - Remote Sedentary Work - Exerting up to 10 pounds of force occasionally and/or a negligible amount of force frequently or constantly to lift, carry, push, pull or otherwise move objects. Typing, communicating, repetitive motions. Close visual acuity to prepare and analyze data, view computer monitors and read. May need to view presentation screens and other visual aids in a virtual setting. Inside environmental conditions with protection from outside elements. Security: Ability to obtain/maintain a Federal Civilian Public Trust U.S. Citizenship or Permanent Resident that has lived in the United States for at least 3 years Federal Civilian Public Trust Consists of a review of up to but not limited to: Covers 10 year period and in some instances lifetime events OPM Security Investigations Index (SII) DOD Defense Central Investigations Index (DCII) National Agency Check (NAC) records FBI name check FBI fingerprint check Credit report check Written inquiries to previous employers and references listed on the application for employment Potential interviews with the subject, spouse, neighbors, supervisor, coworkers Law enforcement check Court records check Education check- Attendance and Degrees Tasks/activities Include, But Are Not Limited To Follows current OI&T Delivery framework and overarching VA (Veterans Affairs) guidance (One-VA Technical Reference Model (TRM)) Uses GitHub, JIRA, and ServiceNow Contributes to design activities Develops code with assistance and independently Participates in code reviews Helps with periodic and adaptive maintenance to applications Aids with modifications to software logic, database schemas, and metadata in accordance with established VA policies and procedures, as necessary, to remediate software defects Supports updates to Defect Management Plan, Monthly Code Plans, Monthly Summary Defect Reports, Annual Summary Defect Reports, Product Sustainment Reports Assesses, remediates, and escalates trouble tickets within established performance targets Analyzes technical issues Provides documentation changes Collaborates with other internal and external groups Participates as a member of the development support team Compensation & Benefits: The annual projected pay range for this position is $50,000 - $55,000 with consideration being given to various factors including but not limited to qualifications, experience, job responsibilities, and geographic location. Oxley Enterprises, Inc. offers a full array of benefits including: Medical, dental, vision and prescription drug coverage for you and your family. Life Insurance, short-term disability and long-term disability paid for by the Company. Supplemental coverages including Accident, Critical Illness, and Hospital. Additional Life insurance coverage for you and your dependents. 401k plan with various options to select based on your retirement goals. Oxley Enterprises®, Inc. is a certified service-disabled veteran-owned (SDVOSB), economic disadvantaged woman-owned (EDWOSB), Small Business Administration Certified 8(a), and small disadvantaged business (SDB) that has 25 years of experience building and delivering quality IT systems and programs. Oxley is ranked in the INC 5000 7 times (2016, 2017, 2018, 2021, 2023, 2024, 2025). Oxley is a 2019 - 2024 Department of Labor HIRE Vets Medallion Award Winner. Oxley is Virginia Values Veterans certified. All qualified applicants will receive consideration for employment without regard to any status protected by applicable federal, state, or local law. If you require a reasonable accommodation to apply for a position at Oxley Enterprises, Inc., please send an email to our Human Resources Department at: careers@oxleyenterprises.com with the following information: Subject Line: Accommodation Request Provide a description of your accommodation request Include your contact information: Full name, Email address, Best number to reach you (optional) We participate in the E-Verify program. http://www.dhs.gov/E-Verify",
    "linkedin_job_id": "4333623524"
  },
  {
    "company_name": "ZORA",
    "linkedin_company_page": "https://www.linkedin.com/company/ourzora/life",
    "title": "Community Support Specialist (Part-Time)",
    "job_location": "Remote",
    "posted_date": "Reposted 4 days ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job About Us Zora is a new kind of on-chain social network where you can express yourself freely, connect with others, and discover the value of your imagination. We believe that by using crypto, we can enable a more equitable system for creators, fundamentally rediscovering the power of the internet. We’re working tirelessly to make Zora available to as many people as possible with a simple, fun, and rewarding consumer app. Our mission is to make creating on the internet free and valuable. About The Role We’re seeking someone passionate about Web3, keen to support creators, and eager to learn everything about Zora. You will engage directly with our community, helping to educate them on navigating the platform, answering questions, and contributing to the growth of our vibrant community. Expected Commitment Time Commitment: 20 hours per week, including at least one day on weekends. Time Zone: Core coverage needed in GMT hours (Western / Central Europe) What You'll Do Triage and prioritize support requests from various sources (social DMs, Front, X, Farcaster, etc.) Collaborate with teammates across time zones to provide round-the-clock coverage Help reduce response times across our key support channels Create tickets in Linear for the Product and Engineering teams to track bug fixes and product changes Perform appropriate content moderation actions across our platforms What We're Looking For Strong understanding of Ethereum, block explorers, tokens, and market mechanics Experience in customer support or community management Collaborative, empathetic, and detail-oriented approach to problem-solving Strong writing skills and adept communication skills Ability to work autonomously in a remote-first environment Familiarity with tokens, DEXs, and crypto on both L1s and L2s An interest in web3 news and culture, especially on Farcaster or X Hands-on experience trading, posting, or using Zora (or similar token/market platforms) Experience in community moderation or engagement Here's The Pay Range At Zora, we carefully consider a variety of factors to determine compensation for each position, including the role, level, and work. The US hourly pay rate range for this position is: Pay Range: $25/hr - $30/hr USD This reflects the compensation target for new hire contractors for the position across all locations. Please note, the compensation details provided do not include benefits and perks that we offer. We also rely on market indicators along with considering your work location, job related skills, experience and relevant education and training, to determine compensation that is fair and competitive for you. Zora will consider paying compensation near the higher of the range in exceptional circumstances, where candidates have the experience, credentials or expertise that would warrant such consideration. It is always our goal to hire exceptional talent and we would be happy to share more about compensation during the hiring process. Zora is an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation. Why Join Us? US-based, Full-time Employees Are Eligible For The Following Remote-First Culture: Work from anywhere in the world! Competitive Compensation: Including salary, pre-IPO stock options, token compensation, and additional financial incentives Comprehensive Benefits: Robust healthcare options, including fully covered medical, dental, and vision for employees Retirement Contributions: Up to 4% employer match on your 401(k) contributions Health & Wellness: Free memberships to One Medical, Teladoc, and Health Advocate Unlimited Time Off: Flexible vacation policies, company holidays, and recharge weeks to prioritize wellness Home Office Reimbursement: To cover home office items, monthly home internet, and monthly cell phone (if applicable) Ease of Life Reimbursement: To cover everything from an Uber home in the rain, childcare, or meal delivery Career Development: Access to mentorship, training, and opportunities to grow your career Inclusive Environment: A culture dedicated to diversity, equity, inclusion, and belonging Our Location: Zora is remote-first and international. Our headquarters are the internet and we have employees all over the world. We’re currently in Los Angeles, New York, San Francisco, Sydney, Berlin, Lisbon, and Vancouver.",
    "linkedin_job_id": "4310719918"
  },
  {
    "company_name": "Mudflap",
    "linkedin_company_page": "https://www.linkedin.com/company/mudflap/life",
    "title": "Software Engineer, Ruby on Rails",
    "job_location": "Palo Alto, CA",
    "posted_date": "2 weeks ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Mudflap serves the $800B trucking industry, the backbone of the U.S. economy. Our market-leading payment products help truckers save thousands of dollars on fuel (their #1 business expense), while providing our fuel stop partners with access to new, hard-to-reach customers. We're a fast-growing marketplace business looking for a new exceptional junior engineer to join our transactions and payments team. Work Location: This can be a fully remote position. While we operate across multiple time zones, most collaboration happens during Pacific Time working hours. Candidates should be able to work a schedule aligned with the PT time zone. Expectations (In this role, you will): Build features for our transactions and payments systems using Ruby on Rails Implement APIs and endpoints following established patterns and guidance Write clean, well-tested and maintainable code with attention to edge cases Debug and fix issues within your area of responsibility Collaborate in code reviews to improve your skills and learn best practices Document your work to support knowledge sharing Take ownership of small to medium features from implementation to deployment Learn our domain-specific knowledge in payments and transaction processing Be flexible and adapt to the changing needs of a startup environment Experience (What we look for): 1-2 years of professional software development experience Bachelor's or Master's degree in Computer Science or equivalent Familiarity with Ruby on Rails or similar web frameworks Ability to work with SQL databases, including writing queries with joins and understanding indexes Knowledge of Git version control workflows Strong problem-solving skills and attention to detail Eagerness to learn and grow as a software engineer Good communication skills and team collaboration abilities Interest in financial technology and payment systems is a plus Our Stack: Backend/API -- Ruby on Rails Database -- Postgres / AWS Aurora Web -- Vue.js and REST iOS -- Native (Swift) Android -- Native (Kotlin) Hosted on -- AWS, deployed as containers on ECS CI/CD -- CircleCI pipeline‍ Perks and Benefits (What we offer): Competitive salary and equity in a high-growth startup Multiple health benefit options Responsible Time Off 401(k) matching Opportunities and support for major career growth Annual Company offsite event (Mudfest!) The salary range for this role is $149,000 - $165,000. This information reflects a base salary range for this position based on current market data, which may be subject to change as new market data becomes available. The candidate's skills, experience, and other relevant factors will determine the exact compensation. Company overview (Who we are): Mudflap is on a mission to transform the trucking and logistics industry by leveling the playing field for owner operators and small fleets. Backed by top-tier venture investors, including QED, Matrix Partners, Commerce Ventures, NFX, and 500 Startups and included in the Forbes Fintech 50 list, Mudflap offers fleet fuel management solutions. Our core team hails from Disney, Uber, Procore, DoorDash, Google, Meta, Capital One, Affirm and Brex. Here are the core values that we believe in and look for in new teammates: Be Customer Obsessed: We deeply understand customer needs and put our customers at the center of everything we do Make it Count: Act like an owner by focusing on the impact of your work Find a Way: Be a creative problem solver who pushes past roadblocks to win for our customers and our teammates Sweat the Details: We keep our standards high and achieve them by paying attention to every detail Be Curious: Use a growth mindset to question assumptions, take calculated risks and stretch the boundaries of what's possible",
    "linkedin_job_id": "4316054703"
  },
  {
    "company_name": "8am",
    "linkedin_company_page": "https://www.linkedin.com/company/weare8am/life",
    "title": "Senior Backend Engineer | Ruby on Rails",
    "job_location": "Austin, TX",
    "posted_date": "5 days ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job It's a new day with a new opportunity at 8am! About us: At 8am, our vision is to power a world where professionals thrive. We start every day on a mission to empower professionals with the most trusted, innovative technology to deliver world-class outcomes for their clients and exceptional financial results for their business. They count on our purpose-built solutions to simplify operations, ensure compliance, and fuel profitable growth, so they can focus on their clients and do more of the work that matters. Founded in 2005, 8am™ (formerly AffiniPay) is the professional business platform built to help legal, accounting, and other client-focused professionals run stronger, more profitable businesses. Today, more than 250,000 professionals across the U.S. trust 8am to help them work smarter, serve clients better, and unlock their full potential. We have been recognized as one of Inc 5000's fastest growing companies in the U.S. for 13 years in a row, and as a result, our teams continue to grow as well! What you'll do: Engage in technical discussions and design of new solutions and architectures Collaborating with our product team on new and existing features to improve user experience and usability Determining feasibility & scalability of front end solutions and guiding the technical design accordingly Owning the implementation of new features Working to improve processes and technologies Mentoring and pairing with other developers on the team Contributing to code reviews with other engineers in order to maintain and improve quality Deploying and managing applications, including static frontend applications, in AWS alongside our operations team About you: BS in Computer Science or Engineering, or equivalent work experience 7+ years of work experience Experience in Ruby/Rails Experience writing automation Experience building JSON APIs Experience using Kubernetes, Helm, and Docker Experience building and deploying production-grade web applications at scale Experience solving large-application/user-level problems, performance, scalability, etc. Well-rounded knowledge of distributed systems and software architecture Experience with SQL, and familiarity with databases such as Postgres or MySql Proficient at debugging sophisticated problems using interactive development tools, logs, and/or IDE Experience guiding and mentoring developers of varying experience levels This position is preferably based in Austin, Texas. Why 8am: At 8am, our culture is shaped by the people who bring it to life every day. Together, we build a company rooted in continuous learning, genuine community, holistic wellness, and meaningful engagement—values that empower us as individuals and unite us as a team. Our culture is grounded in our core values: Work Smart, Win Fast; Outshine Ordinary, and We Find a Way. These values drive how we serve our customers and work with each other in a collaborative, inspiring, and empowering environment, every day. Here's how we support our 8Team: Health Insurance Coverage: We offer our 8Team a variety of medical, dental, and vision plans, designed to fit your needs, including a 100% company-paid HDHP plan for employees. Financial perks: We offer a competitive compensation and benefits package including annual bonuses, equity options and 401(k) or RRSP if in Canada, with a company match for all team members. Time for what matters: Flexible Time Off, paid holidays, and a parental leave program for our new parents. Wellness: Wellness stipends, mental health support, and one-on-one nutrition coaching. Learning and Development: Continuous learning through 8am.edu, leadership programs, professional development funds, and individually focused talent development. Giving back to the communities around us: Participate in our charitable matching gift program, paid time off for volunteer service, and company-sponsored volunteer events (both local and virtually). Engagement: Virtual and in-person team-building events, quarterly award recognition through our Rise & Shine Award of Excellence Program, and our peer-to-peer appreciation platform. At 8am, we don't just offer benefits - we create an environment where people can thrive, grow, and make a real impact every day. Diversity, equity & inclusion at 8am: At 8am, we recognize that innovation occurs with a strong team of people who are diverse in background, personality, talent and ideas. Experience comes in many forms and ensuring a diverse and inclusive workplace where we continue to learn from each other is an integral part of our culture. We are committed to creating a welcoming and transparent environment for all that embraces those differences through education, equal access to opportunities and information, inclusionary programs, and community outreach. Security advisory: Our hiring teams at 8am are dedicated to recruiting top talent that share our passion for serving the professional services industry through innovative financial technology. As such, our Talent Acquisition Team only follows legitimate hiring practices. We will always communicate with our candidates using emails with the 8am domain and will never ask for sensitive/personal data during the application process. All interviews take place over phone call, Zoom/Google Meet or in person. All offers are communicated verbally by our Talent Acquisition Specialists with a written offer letter as a follow up.",
    "linkedin_job_id": "4333058892"
  },
  {
    "company_name": "Mercor",
    "linkedin_company_page": "https://www.linkedin.com/company/mercor-ai/life",
    "title": "Remote Content Verification Specialist",
    "job_location": "Remote",
    "posted_date": "1 day ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job About The Job Mercor connects elite creative and technical talent with leading AI research labs. Headquartered in San Francisco, our investors include Benchmark, General Catalyst, Peter Thiel, Adam D'Angelo, Larry Summers, and Jack Dorsey. Position: Independent Contractor Type: Independent Contractor Compensation: $35/hour Location: U.S., UK, or Canada Duration: Approximate 4 day engagement Commitment: 20–40 hours/week Role Responsibilities Review and validate prompt responses for accuracy, completeness, and clarity. Identify ambiguities, subjective phrasing, or formatting inconsistencies. Provide structured feedback to improve data quality and consistency. Collaborate with AI research teams to ensure reliable and accurate model outputs. Work independently and asynchronously to meet deadlines and improve AI model performance. Qualifications Must-Have Strong attention to detail with the ability to spot inconsistencies. Skilled in verifying information across multiple domains and sources. Clear and objective written communication skills. Analytical, meticulous, and reliable in following structured guidelines. Compensation & Legal Independent contractor arrangement through Mercor. Paid weekly via Stripe Connect. Application Process (Takes 20–30 mins to complete) Submit a short form and complete a brief interview. Complete a short screening test upon invitation. Resources & Support For details about the interview process and platform information, please check: https://talent.docs.mercor.com/welcome/welcome For any help or support, reach out to: support@mercor.com PS: Our team reviews applications daily. Please complete your AI interview and application steps to be considered for this opportunity. ,",
    "linkedin_job_id": "4334011025"
  },
  {
    "company_name": "Prevail.ai",
    "linkedin_company_page": "https://www.linkedin.com/company/prevaillegal/life",
    "title": "Mid-Level Full Stack Developer (Ruby on Rails)",
    "job_location": "Miami, FL",
    "posted_date": "8 months ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job About Prevail Legal A well-funded startup founded in San Francisco, our workforce includes a diverse collection of individuals located across the country. Our first-of-its-kind platform combines secure video conferencing with a collection of intuitive tools developed for conducting remote, in-person, and hybrid legal proceedings. By maintaining a dynamic work environment where employees collaborate and grow, we aim to modernize and transform the processes involved in court reporting, testimony management, trial preparation, use of video evidence, and more. Join us in disrupting the legal industry and beyond while working alongside our talented team! About the Position: We are seeking a motivated and skilled Mid-Level Full Stack Developer with experience in Ruby on Rails. As a Mid-Level Full Stack Developer, you will contribute to building and maintaining web applications, collaborating with the team to implement new features, and optimizing performance. You will work with both object-oriented and functional programming paradigms in a fully remote environment. Success in this role requires a solid understanding of Git/source control and familiarity with Gen-AI tools and their practical applications in development workflows. This position reports to the Chief Technology Officer. Required Qualifications: 4+ years of Ruby on Rails experience Strong understanding of Git/source control systems Solid understanding of object-oriented and functional programming paradigms Ability to write clear technical documentation Familiarity with Gen-AI tools and their practical applications in development workflows Preferred Knowledge: Familiarity with WebRTC Experience writing performant JavaScript preferably Stimulus, Hotwire, or Importmaps Understanding of asset optimization techniques Experience with PostgreSQL (1+ year preferred) Exposure to AWS/Kubernetes environments Ideal Candidate: A passionate self-starter with strong time-management skills Exceptional problem-solving ability and critical thinking Collaborative but capable of working independently Experience working in smaller companies or startups is a plus Interest in mentoring junior developers and growing within the company Benefits: Comprehensive medical, dental, vision, and 401(k) plans PTO, including vacation and company holidays Generous continuing education allowance Employee stock option plan Remote-first workplace Open, diverse, and respectful work culture Compensation Range: $120,000 - $160,000 per year. The final base salary will be determined based on several factors, including geographical location, level of experience, relevant skills, and knowledge. Prevail Legal reserves the right to change this job description to meet the organization's business needs. Please note that the pay band listed is for major cities, and compensation is based on both location and experience. We are hiring for US Citizens and do not provide H1B Visa support. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status. We are proud to be an equal opportunity workplace.",
    "linkedin_job_id": "4161858461"
  },
  {
    "company_name": "Crossing Hurdles",
    "linkedin_company_page": "https://www.linkedin.com/company/crossinghurdles/life",
    "title": "Researcher | $40/hr Remote",
    "job_location": "Remote",
    "posted_date": "1 week ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job At Crossing Hurdles, we work as a referral partner. We refer candidates to our partner that collaborates with world’s leading AI research labs to build and train cutting-edge AI models. Position: Generalist Evaluator Expert Type: Hourly Contract Compensation: $35–$40/hour Location: Remote Duration: Approximately 1 month Commitment: 20-40 hours/week, flexible and asynchronous Role Responsibilities (Training support will be provided) Design and optimize detailed prompts with multiple constraints and clear instructions for language model evaluation Define and document evaluation standards and develop comprehensive rubrics for assessing correct responses in consumer contexts Conduct testing and grading by running prompts through AI models and assessing outputs against expectations Support benchmarking and quality assurance to ensure prompt rigor and consistency before integration into official evaluation sets Collaborate with team members in quality assurance review processes to maintain evaluation reliability Requirements BS or BA degree from a reputable institution (completed or in progress) Strong writing skills, critical thinking, and instructional clarity Ability to work independently and meet deadlines Significant familiarity with ChatGPT or similar language tools for personal or professional use Experience in teaching or research is preferred Access to a desktop or laptop computer (Chromebooks are not supported) Application process: (Takes 20 min) Upload resume AI interview based on your resume (15 min) Submit form",
    "linkedin_job_id": "4332003152"
  },
  {
    "company_name": "ArcheSys Inc",
    "linkedin_company_page": "https://www.linkedin.com/company/archesys-inc/life",
    "title": "Full-Stack Engineer - Ruby on Rails (Remote)",
    "job_location": "Baltimore, MD",
    "posted_date": "1 week ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Archesys is a technology firm specializing in innovative digital solutions and services for clients across various industries. We pride ourselves on our cutting-edge technologies, exceptional customer service, and collaborative work environment. We are seeking a highly skilled and motivated Full-Stack Engineer - Ruby on Rails to join our growing engineering team. In this role, you will be instrumental in developing accessible, responsive, and maintainable user experiences for high-impact government services. You will collaborate closely with product managers, designers, and other engineers in an agile environment to deliver high-quality software that meets our users' needs. This role demands a proactive problem-solver who can manage multiple projects while delivering high-quality solutions. The ideal candidate thrives in a collaborative, fast-paced environment and has experience building robust applications with modern tools and practices. This is a fully remote, full-time position. Roles And Responsibilities Key Responsibilities: Full-Stack Feature Development: Contribute to the full-stack development of responsive and highly accessible features. This includes building critical user flows such as building form flows, data reporting and collections, user access management. Design System Contribution: Actively contribute to and maintain frontend standards, potentially supporting the future development and adoption of the MD Web Design System (MDWDS), primarily through Web Components (Lit). Collaboration & Mentorship: Collaborate cross-functionally with engineers, designers, and product managers to refine technical requirements and drive value for end-users. Quality & Standards: Lead by example in code quality. Actively participate in code reviews, providing crucial frontend expertise and design system context to ensure all colleagues uphold maintainability and accessibility standards. Technical Alignment: Utilize strong technical judgment and clear communication to ensure development efforts are aligned with overall business and project goals. What You'll Bring Required Skills & Experience: Ruby on Rails Proficiency: Deep experience in Ruby on Rails development, especially leveraging ERB templates for frontend output. Modern Frontend Expertise: Proficiency in core web technologies: JavaScript, modern CSS (e.g., Sass/SCSS, CSS-in-JS), and browser-native Web Components. Accessibility & Responsiveness: Proficient knowledge and practical experience in modern web accessibility practices (WCAG) and responsive design. Communication: Excellent verbal and written communication skills, with the ability to effectively translate technical concepts for both technical and non-technical audiences. Preferred Skills & Experience 4-8 years of professional experience with Frontend UI support Ruby on Rails in a production environment. Experience designing, building, or maintaining shared component libraries or design systems that are utilized across multiple project teams. Proficient in Ruby on Rails development using ERB templates Proficient in front-end development, including: JavaScript, modern CSS, and browser-native web components Proficient in modern accessibility and web-responsive practices Experience designing and maintaining shared libraries used across multiple project teams within an organization. Familiarity with the Lit library for building lightweight Web Components. Experience with federal or state government design systems like USWDS or working with static site generators like Eleventy. Strong problem-solving skills and ability to work independently and within a team. Excellent communication and collaboration skills Experience working in an agile environment Passion for building high-quality software Educational Background: Bachelor's degree in Computer Science, Information Technology, Engineering or a related field. A Master's degree will be considered a plus. Stakeholder Communication Foster open communication with stakeholders, providing regular updates on project status and milestones. Act as one of the point of contact between clients, stakeholders, and development teams. Communicate regularly with stakeholders, including product managers, executives, and customers, to keep them informed of progress and address any concerns. Excellent communication with technical and non-technical audiences. Cross-Functional Collaboration Collaborate with various departments to ensure the seamless integration of technologies and solutions. Facilitate problem-solving sessions to address complex challenges and foster innovation. Personal Attributes Strong leadership qualities, with the ability to collaborate effectively across cross-functional teams. Forward-thinking with a keen eye for identifying opportunities for innovation and improvement. Detail-oriented with a commitment to maintaining high standards of quality and efficiency. Additional Requirements A willingness to continually learn and adapt to the evolving technology landscape. Ability to work in a fast-paced environment and manage multiple projects simultaneously. All work must be conducted within the U.S., excluding U.S. territories. Some federal contracts require U.S. citizenship to be eligible for employment. You must be legally authorized to work in the U.S. now and in the future without sponsorship. As the US Government is our clientele, you may be required to obtain a public trust or security clearance. Some of our available roles are on federal contracts that require a degree or additional years of experience as a substitute. What We Offer Competitive salary and benefits package, including reimbursement plan health, dental, and vision insurance, retirement plan, and generous paid time off. Opportunity to work with a talented team of professionals on exciting and innovative projects. Flexible work arrangements, including remote work options. Continuous learning and development opportunities, including access to training resources and professional development programs. A collaborative, inclusive work environment that values diversity and encourages growth. Join us at Archesys and be part of a team dedicated to delivering cutting-edge cloud solutions for clients in the public sector. Your expertise and passion for technology will help us continue to innovate and grow. We look forward to welcoming you to our team and supporting your success as a Full-Stack Engineer - Ruby on Rails. Archesys participates in E-Verify. Upon hire, we will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S. Archesys is an equal opportunity employer committed to creating a diverse and inclusive workplace. We welcome applications from all qualified candidates, regardless of race, color, religion, sex.Work collaboratively with different departments to ensure seamless integration of technologies and solutions. Organize problem-solving sessions to tackle complex challenges and encourage innovation.",
    "linkedin_job_id": "4332824906"
  },
  {
    "company_name": "Jobgether",
    "linkedin_company_page": "https://www.linkedin.com/company/jobgether/life",
    "title": "Senior Backend Engineer | Ruby on Rails",
    "job_location": "Remote",
    "posted_date": "1 week ago",
    "applicant_count": "57 applicants",
    "salary": "Not specified",
    "description": "About the job This position is posted by Jobgether on behalf of a partner company. We are currently looking for a Senior Backend Engineer | Ruby on Rails in United States. As a Senior Backend Engineer, you will be responsible for designing, building, and maintaining robust, scalable web applications that power core business operations. You will collaborate closely with product, design, and engineering teams to implement new features, improve performance, and ensure a seamless user experience. This role requires strong expertise in Ruby on Rails, distributed systems, and cloud infrastructure, along with a hands-on approach to problem-solving and mentoring junior developers. You will have the opportunity to influence architecture, automation, and deployment processes while contributing to a culture of technical excellence and innovation. This is an exciting position for an engineer passionate about building production-grade applications that scale. Accountabilities Participate in technical discussions and design of new solutions, architectures, and features Collaborate with product and engineering teams to improve usability, performance, and scalability Implement new backend features, including building and maintaining JSON APIs Deploy and manage applications in cloud environments (AWS), working with DevOps teams to ensure reliability and performance Contribute to code reviews and mentor team members to maintain high-quality standards Improve internal processes, development practices, and technology choices to optimize engineering efficiency Debug and resolve complex production-level issues, ensuring smooth system operation Requirements Bachelor's degree in Computer Science, Engineering, or equivalent work experience Minimum 7 years of experience building production-grade web applications Strong experience with Ruby on Rails and backend development Proficiency in automation, JSON APIs, and distributed systems Hands-on experience with Kubernetes, Helm, Docker, and cloud infrastructure Solid understanding of SQL databases, such as Postgres or MySQL Proven ability to solve large-scale application and performance challenges Experience mentoring and guiding developers of varying experience levels Excellent problem-solving, debugging, and communication skills Benefits Competitive base salary and annual bonuses Equity options and 401(k) plan with company match (or RRSP if in Canada) Flexible time off, paid holidays, and parental leave programs Comprehensive health, dental, and vision insurance, including a 100% company-paid HDHP plan Wellness support including stipends, mental health resources, and one-on-one nutrition coaching Continuous learning through internal programs, leadership training, and professional development funds Opportunities for community engagement, volunteer work, and charitable matching programs Collaborative, inclusive culture with team-building events and recognition programs Jobgether is a Talent Matching Platform that partners with companies worldwide to efficiently connect top talent with the right opportunities through AI-driven job matching. When you apply, your profile goes through our AI-powered screening process designed to identify top talent efficiently and fairly. 🔍 Our AI evaluates your CV and LinkedIn profile thoroughly, analyzing your skills, experience, and achievements. 📊 It compares your profile to the job's core requirements and past success factors to determine your match score. 🎯 Based on this analysis, we automatically shortlist the three candidates with the highest match to the role. 🧠 When necessary, our human team may perform an additional manual review to ensure no strong profile is missed. The process is transparent, skills-based, and free of bias — focusing solely on your fit for the role. Once the shortlist is completed, we share it directly with the company that owns the job opening. The final decision and next steps (such as interviews or additional assessments) are then made by their internal hiring team. Thank you for your interest!",
    "linkedin_job_id": "4317609198"
  },
  {
    "company_name": "PrizePicks",
    "linkedin_company_page": "https://www.linkedin.com/company/prize-picks/life",
    "title": "Back End Engineer III",
    "job_location": "Remote",
    "posted_date": "Reposted 1 week ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job At PrizePicks, we are the fastest-growing sports company in North America, as recognized by Inc. 5000. As the leading platform for Daily Fantasy Sports, we cover a diverse range of sports leagues, including the NFL, NBA, and Esports titles like League of Legends and Counter-Strike. Our team of over 450 employees thrives in an inclusive culture that values individuals from diverse backgrounds, regardless of their level of sports fandom. Ready to reimagine the DFS industry together? Overview Software Engineers at PrizePicks work to develop, maintain and test software within the PrizePicks ecosystem. Software Engineers work closely with Product Managers, Designers and other Software Engineers to solve product challenges and technical challenges to achieve desired business outcomes. Responsibilities Advocate for improvements to product quality, security, and performance Collaborate with stakeholders to maintain a high bar for quality Collaborate with team members to solve technical and product challenges Develop product features and technical improvements to the PrizePicks ecosystem Develop unit or end-to-end testing for the PrizePicks ecosystem Follow best practice guidelines for maintainability and style Participate in on-call incident rotations Participate in code reviews Studies and learns previous software patterns in the PrizePicks ecosystem Senior Responsibilities Advocate for improvements that have an impact across your team Collaborate with the team on larger projects Diagnose and fix performance and optimization problems Define, advocate and improve best practices for maintainability and style Define a technical path from product idea to deployment Provide mentorship to Software Engineers I, II, and III across your team Ship features and improvements to the PrizePicks ecosystem with little to no guidance from across the team Solve product challenges and technical problems of high scope and complexity Requirements A kind and positive mindset A passion to be better at your craft than the day before A self-motivated and self-managing attitude A sense of urgency to solve problems Ability to clearly and concisely communicate about technical, and/or organizational problems and propose solutions Ability to concisely communicate with other employees Ability to thrive in a fully remote organization Ability to work closely with other parts of the organization that may be outside of the Engineering organization Ability to document guides for others in the Engineering organization Comfort working in a fast paced industry where product or technical challenges may appear frequently Comfort working with technical problems that might not always have an obvious solution Proficiency in the English language, both written and verbal Qualifications 5 to 8 years of relevant work experience Expert to mastery experience with: Ruby on Rails Postgres History of owning product challenges and technical challenges in a team to drive a desired business outcome Nice To Haves Experience with in tech startups Experience working with a remote team Passionate about the daily fantasy industry Any experience in the following technologies: Kubernetes Docker Shell scripting Linux or similar UNIX type operating systems Where you’ll live: While we prefer candidates based in Atlanta, we are open to qualified applicants from anywhere in the U.S. and are willing to consider remote candidates. Working at PrizePicks: The typical salary range for this position is $165,000 to $180,000. At PrizePicks, we consider your role, level, and where you'll be working when determining our salary ranges. The compensation info you see on our job postings gives you an idea of the starting pay range for the position. Your actual pay within that range will depend on your specific work location, as well as your skills, experience, and education. Your recruiter will be happy to chat more about the specific pay range for your location and how we arrived at it during the hiring process. This application period will remain open for 30 days. We’re committed to finding the best candidate, so this date may be adjusted, and any changes will be reflected in this posting. Date Posted: July 28, 2025 First Extension: August 27, 2025 Second Extension: September 26, 2025 Benefits you’ll receive: In addition to your great compensation package, full-time employees will be eligible for the following perks: Company-subsidized medical, dental, & vision plans 401(k) plan with company match Annual bonus Flexible PTO to encourage a healthy work/life balance (2 weeks STRONGLY encouraged!) Generous paid leave programs, including 16-week paid parental leave and disability benefits Workplace flexibility and modern work schedules focused on getting the job done, not hours clocked Company-wide in-person events and team outings Lifestyle enhancement program Company equipment provided (Windows & Mac options) Annual performance reviews with opportunities for growth and career development You must be authorized to work for any employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time. PrizePicks is an Equal Opportunity Employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.",
    "linkedin_job_id": "4273505240"
  },
  {
    "company_name": "Experian",
    "linkedin_company_page": "https://www.linkedin.com/company/experian/life",
    "title": "Fraud Analytics Summer Intern (Remote & Paid)",
    "job_location": "Remote",
    "posted_date": "1 day ago",
    "applicant_count": "Over 100 applicants",
    "salary": "Not specified",
    "description": "About the job Job Posting - Salary Range: See Pay Range Company Description Experian is a global data and technology company, powering opportunities for people and businesses around the world. We help redefine lending practices, uncover and prevent fraud, simplify healthcare, create digital marketing solutions, and gain deeper insights into the automotive market, all using our unique combination of data, analytics, and software. We also assist millions of people in realizing their financial goals and saving time and money. We operate across a range of markets, from financial services to healthcare, automotive, agrifinance, insurance, and many more industry segments. We invest in people and new advanced technologies to unlock the power of data and to innovate. We're focused on powering opportunities, which is why the Experian Summer Internship Program gives students across the country the chance to apply their education to real-world challenges through meaningful, hands-on projects. Rooted in our 'People First' philosophy, our interns experience firsthand our commitment to personal and professional development. Proudly named one of the Top 100 Internship Programs three years in a row, we invite you to join us and explore your potential with a team that's invested in your growth. A FTSE 100 Index company listed on the London Stock Exchange (EXPN), we have a team of 25,500 people across 32 countries. Our corporate headquarters are in Dublin, Ireland. Learn more at experianplc.com. Job Description The Fraud Analytics Intern will work under the Data Scientist. You will work on a project focused on developing new interdisciplinary fraud attributes using cloud technologies. This will involve exploring data sources across domains and engineering novel features to enhance fraud detection models. Responsibilities Integrate and analyze data from credit, identity, and behavioral domains to create new fraud features. Apply programming and analytical skills for data processing, feature engineering, and model building in cloud environments. Collaborate with data scientists and engineers to assess the effectiveness of newly developed attributes. Develop and evaluate predictive models using newly engineered attributes. Document methodologies and present findings to support knowledge sharing and strategic plans. Qualifications Currently enrolled in a minimum of a Bachelor's degree program or above in Data Science, Statistics, Computer Science, or related field Return to school in the Fall of 2026 to complete degree program Proficient in statistical analysis, predictive modeling, machine learning and working with large datasets Proficient in Python, PySpark for data analysis and modeling Familiarity with cloud computing services (AWS) Knowledge in credit or fraud risk modeling Benefits/Perks Additional Information Fully remote Volunteer Time Off Great compensation Flexible work schedule Eligible for 401(k) participation in 90 days At Experian, our people and culture set us apart. We're deeply committed to creating an environment where everyone feels they belong and can excel. From inclusion and authenticity to work/life balance, development, wellness, collaboration, and recognition, we focus on what truly matters. Our people-first approach has earned us global recognition: World's Best Workplaces™ 2024 (Fortune Top 25), Great Place To Work™ 2025 in 26 countries, and Glassdoor Best Places to Work 2024, among others. Want to see what life at Experian is really like? Explore Experian Life on social or visit our Careers Site. Our compensation reflects the cost of labor across several U.S. geographic markets. The hourly pay range for this position is listed above. Within this range, individual pay is determined by work location and additional factors such as job-related skills, experience, and education. Experian is proud to be an Equal Opportunity Employer for all groups protected under applicable federal, state and local law, including protected veterans and individuals with disabilities. If you have a disability or special need that requires accommodation, please let us know at the earliest opportunity. #EarlyCareers",
    "linkedin_job_id": "4333932943"
  },
  {
    "company_name": "Stitch Fix",
    "linkedin_company_page": "https://www.linkedin.com/company/stitch-fix/life",
    "title": "Full Stack Lead Software Engineer – Payments",
    "job_location": "Remote",
    "posted_date": "1 day ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job About Stitch Fix, Inc. Stitch Fix (NASDAQ: SFIX) is the leading online personal styling service that helps people discover the styles they will love that fit perfectly so they always look - and feel - their best. Few things are more personal than getting dressed, but finding clothing that fits and looks great can be a challenge. Stitch Fix solves that problem. By pairing expert stylists with best-in-class AI and recommendation algorithms, the company leverages its assortment of exclusive and national brands to meet each client's individual tastes and needs, making it convenient for clients to express their personal style without having to spend hours in stores or sifting through endless choices online. Stitch Fix, which was founded in 2011, is headquartered in San Francisco. About The Team Stitch Fix’s Payment team is a group of six engineers who own the technology powering how our clients are able to purchase our products, and the financial system reconciliation of said payments. Our mission is to create seamless, secure, and transparent Payments and Risk platform experiences that foster trust and loyalty between Stitch Fix and our clients. We are committed to enabling a frictionless experience through improved First Fix conversion and AOV with optimized cost, process efficiency and reduced shrink rate. The primary responsibilities of the Payments team include: ownership of payment processing systems, payment processing vendor integration (e.g. Braintree/PayPal, Stripe), client invoices, client credits, sales tax, financial reports (SOX Compliance), fraud detection systems, and supporting our CS partners through their payment interactions with clients. About The Role In Payments Engineering, we are scaling our payments system to serve more and more clients. As a Lead Software Engineer, you will help shape the future of Stitch Fix’s payments systems. You will also be responsible for planning, building, and maintaining features and software in support of that future. Building valuable and sustainable software is a group activity. You will work within a distributed team of 4 - 6 software engineers and cross-functional partners including product, design, algorithms, finance, etc. You are expected to have strong written communication skills and be able to develop strong working relationships with coworkers and business partners. You will need to know when and how to listen to, influence, coach, share with, advocate to, and lead others. This is a remote position available within the United States. We operate in an agile-inspired manner; collaborating across multiple time zones. We build modern software with modern techniques like TDD, continuous delivery, DevOps, and service-oriented architecture. We focus on high-value products that solve clearly identified problems but are designed in a sustainable way and deliver long-term value. You're Excited About This Opportunity Because You Will… Operate as an engaged member of the engineering team - leading meetings, attending ceremonies, providing input on technical design documents & project plans, pairing with other engineers to work toward a solution, etc. Collaborate with stakeholders while leading the execution of complex and/or critical projects within the Payments team or across multiple engineering teams. Model consistently sustainable results against measurable goals. Break down projects into actionable milestones. Proactively communicate status updates or changes to the scope or timeline of projects to stakeholders and leadership. Provide technical leadership, mentorship, pairing opportunities, timely feedback, and code reviews to encourage the growth of others. Actively invest in the professional development and career growth of your teammates and peers. Frame business problems using high-quality data analysis and empirical evidence for leadership. Find new and better ways of doing things that align with business priorities. Influence other engineers toward right-sized solutions. Participate in on-call rotations and improve the on-call experience for others. Help Stitch Fix continue to develop new methods of collaborating with partners across the organization. We’re Excited About You Because… You have roughly 5+ years of professional programming experience. You have experience in the payment processing engineering space You have hands-on experience with running Ruby on Rails, along with other modern web stacks (e.g. Golang, Postgres, GraphQL, Kafka). You have hands-on experience with frontend frameworks (e.g. Next.js, React, JavaScript, CSS, TypeScript). You have 1+ years of experience in technical leadership - including driving technical decisions and guiding broader project goals. You are bright, kind, and motivated by challenges. You have excellent analytical skills as well as communication skills both verbal and written. You treasure helping your team members grow and learn. You take initiative and operate with accountability. You are motivated by solving problems and finding creative client-focused solutions. You build high-quality solutions and are pragmatic about weighing project scope and value. You are flexible, dedicated to your craft, and curious. You might have experience working remotely alongside a distributed software engineering team. You might have experience with evolving a resilient distributed service architecture. You might have experience with GraphQL schema design. You might have prior experience with accessibility best practices. About The Technology Technologies we rely on to pursue solutions to business problems include things like: Ruby Rails GraphQL Node.js RailsReact & Next.js JavaScript / TypeScript CSS / SCSS Figma Datadog QL and PostgreSQL Kafka Why you'll love working at Stitch Fix... We are a group of bright, kind people who are motivated by challenge. We value integrity, innovation and trust. You’ll bring these characteristics to life in everything you do at Stitch Fix. We cultivate a community of diverse perspectives— all voices are heard and valued. We are an innovative company and leverage our strengths in fashion and tech to disrupt the future of retail. We win as a team, commit to our work, and celebrate grit together because we value strong relationships. We boldly create the future while keeping equity and sustainability at the center of all that we do. We are the owners of our work and are energized by solving problems through a growth mindset lens. We think broadly and creatively through every situation to create meaningful impact. We offer comprehensive compensation packages and inclusive health and wellness benefits. Compensation And Benefits This role will receive a competitive salary, benefits, and equity. The salary for US-based employees hired into this role will be aligned with the range below, which includes our three geographic areas. A variety of factors are considered when determining someone’s compensation–including a candidate’s professional background, experience, location, and performance.This position is eligible for new hire and ongoing grants of restricted stock units depending on employee and company performance. In addition, the position is eligible for medical, dental, vision, and other benefits. Applicants should apply via our internal or external careers site. Salary Range $111,800—$186,000 USD This link leads to the machine readable files that are made available in response to the federal Transparency in Coverage Rule and includes negotiated service rates and out-of-network allowed amounts between health plans and healthcare providers. The machine-readable files are formatted to allow researchers, regulators, and application developers to more easily access and analyze data. Please review Stitch Fix's US Applicant Privacy Policy and Notice at Collection here: https://stitchfix.com/careers/workforce-applicant-privacy-policy Recruiting Fraud Alert: To all candidates: your personal information and online safety are top of mind for us. At Stitch Fix, recruiters only direct candidates to apply through our official career pages at https://www.stitchfix.com/careers/jobs or https://web.fountain.com/c/stitch-fix. Recruiters will never request payments, ask for financial account information or sensitive information like social security numbers. If you are unsure if a message is from Stitch Fix, please email careers@stitchfix.com. You can read more about Recruiting Scam Awareness on our FAQ page here: https://support.stitchfix.com/hc/en-us/articles/1500007169402-Recruiting-Scam-Awareness",
    "linkedin_job_id": "4333950685"
  },
  {
    "company_name": "Clair",
    "linkedin_company_page": "https://www.linkedin.com/company/clair/life",
    "title": "General Interest Application",
    "job_location": "Remote",
    "posted_date": "Reposted 5 months ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job About Clair If you can send your friends money in seconds, why does it still take your employer two weeks to send your paycheck? At Clair, we are on a mission to create financial freedom for America's workers by giving them a digital banking platform that allows them to get paid as soon as they clock out of work. But we're not just another digital bank or on-demand pay provider. We meet Americans at their place of work by embedding our products within the scheduling, workforce management, and payroll apps they already use every day. Learn more about us at getclair.com/about About The Role Maybe you don’t see the exact job you’re looking for right now—and that’s okay. At Clair, we know that great talent doesn’t always wait for the perfect posting. That’s why we created this open application: a chance for you to raise your Clair-hand and tell us how you want to help shape the future of financial wellness. We're always on the lookout for passionate people who believe in what we’re building. Whether your expertise lies in engineering, product, design, compliance, operations, data, or somewhere delightfully uncharted—if you see a future here, we’d love to hear about it. Think of this as your invitation to the Clairside—where life is simple, and pay is even simpler. Key Responsibilities (That You Might Have) Since this isn’t tied to a specific role, we can’t list exact tasks—but here’s what we do know: You’re excited to build, improve, or scale something meaningful You believe in designing for clarity, simplicity, and real human impact You’re collaborative, proactive, and thrive in environments where ideas move quickly You want your work to support people who work the hardest, every day Whether you’re a seasoned leader or a rising star, there’s room on our team for people who care deeply and execute thoughtfully. You're excited to be part of a team that’s caring, candid, and never afraid to bring a little joy to the workday (we take Clairaoke seriously) Qualifications We’re not looking for a one-size-fits-all background—but we’ll probably want to talk to you if: You’re driven by purpose, and Clair’s mission resonates with you You bring clarity to complexity You’ve worked in fast-paced environments and know how to turn ambiguity into action You communicate with empathy and intention You’re curious, kind, and always willing to roll up your sleeves If you're an engineer, product strategist, data scientist, designer, operations whiz—or something entirely unique—we want to know how you'd like to contribute. We can’t wait to meet you—even if the timing isn’t Clair-perfect just yet! Need more convincing? Benefits Apart from getting to work with our incredible team, here are some of the benefits you can expect when you join Clair: Medical, Dental, & Vision Coverage, with option to extend to your family Fully-paid parental leave Company-sponsored 401k, HSA, and FSA Unlimited vacation for salaried roles, generous PTO for hourly roles Work from home setup allowance Access to your earnings every day on Clair Company-sponsored short-term and long-term disability insurance Equal Opportunity Employer Information Clair is an equal opportunity employer and we value diversity at our company. We actively seek a diverse applicant pool and do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. For questions, please email us at careers@getclair.com",
    "linkedin_job_id": "4233163734"
  },
  {
    "company_name": "Twine",
    "linkedin_company_page": "https://www.linkedin.com/company/twine-net/life",
    "title": "Website Developer (Remote)",
    "job_location": "Remote",
    "posted_date": "United States · 18 hours ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Join a project focused on building a multi event management platform using Laravel. This assignment is ideal for a developer with proven experience in PHP frameworks, particularly Laravel, who can deliver robust and maintainable code within a short timeframe. The role is fully remote and requires availability for up to one week, making it suitable for professionals seeking a focused, impactful project. Responsibilities Develop and implement core features for a multi event management platform using Laravel Write clean, efficient, and well-documented code Collaborate with the project owner to define requirements and deliverables Ensure the platform is scalable, secure, and user-friendly Troubleshoot, debug, and optimize application performance Deliver completed project components within the agreed timeline Skills And Requirements Strong proficiency in PHP and Laravel framework Experience with MySQL or similar relational databases Familiarity with RESTful APIs and third-party integrations Ability to work independently and manage time effectively Solid understanding of web application security best practices Excellent problem-solving and communication skills Previous experience delivering projects remotely Availability for a one-week assignment About Twine Twine is a leading freelance marketplace connecting top freelancers, consultants, and contractors with companies needing creative and tech expertise. Trusted by Fortune 500 companies and innovative startups alike, Twine enables companies to scale their teams globally. Our Mission Twine's mission is to empower creators and businesses to thrive in an AI-driven, freelance-first world.",
    "linkedin_job_id": "4337717285"
  },
  {
    "company_name": "Strategic Employment Partners (SEP)",
    "linkedin_company_page": "https://www.linkedin.com/company/strategic-employment-partners-sep-/life",
    "title": "Ruby on Rails Staff Engineer",
    "job_location": "Remote",
    "posted_date": "9 hours ago",
    "applicant_count": "34 applicants",
    "salary": "Not specified",
    "description": "About the job About Us: We are working with a mission-driven SaaS company dedicated to keeping people safe. They're passionate about public safety and strive to create innovative solutions that keep their customer's happy. Job Description: As a Senior Staff Engineer, you will play a crucial role in building and maintaining our cutting-edge web applications. You will work closely with our engineering team to design, develop, and deploy robust, scalable, and user-friendly features. Responsibilities: Design, develop, and maintain backend applications using Ruby on Rails. Build user-friendly and responsive frontend interfaces using React. Collaborate with cross-functional teams to define and implement new features. Write clean, well-tested, and efficient code. Qualifications: Strong proficiency in Ruby on Rails, React, and React Native. Experience with relational databases (e.g., PostgreSQL). Solid understanding of JavaScript and web development fundamentals. Familiarity with RESTful APIs and microservices architecture.",
    "linkedin_job_id": "4320765930"
  },
  {
    "company_name": "Airbnb",
    "linkedin_company_page": "https://www.linkedin.com/company/airbnb/life",
    "title": "Market Associate",
    "job_location": "Florida, United States",
    "posted_date": "1 day ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way. The Community You Will Join Our Supply Team is growing, and we want you to be part of it! As a Market Associate, you will play a crucial role in the retention, growth, and optimization of host entrepreneurs and rising hosts in your assigned territory. You will focus on building strong relationships with these hosts, helping them optimize their listings, improve pricing strategies, and enhance their overall success on Airbnb. The Difference You Will Make As a Market Associate, you will be responsible for the retention and growth of long-tail Hosts in an assigned territory. You will establish and nurture business relationships with emerging professional host accounts by suggesting and supporting strategic initiatives that drive their success on Airbnb. These initiatives will include supply optimization, pricing optimization, host recruitment, and platform education. In addition, as these Hosts successfully grow on the platform, it will be imperative that you help them maintain best-in-class hospitality standards for an excellent guest experience. Beyond one-to-one account management responsibilities, you’ll also support Market Managers on your team to deliver one-to-many education programs, such as webinars and scaled e-mail communication. Ultimately, this team will be responsible for helping long-tail Hosts thrive on Airbnb. A Typical Day Manage a book of business consisting of host entrepreneurs and rising hosts, ensuring their retention, growth, and optimization on Airbnb. Conduct one-on-one optimization and onboarding conversations, providing strategic recommendations on pricing, availability, and listing quality. Secure availability over high compression dates, ensuring hosts maximize their revenue potential. Educate hosts on product updates and policy changes, while channeling their feedback to internal teams. Respond to host inquiries and provide timely, high-quality support to improve their experience on the platform. Analyze performance data to identify trends and take action on opportunities that drive increased bookings and host success. Develop long-lasting relationships with hosts, ensuring they receive ongoing support tailored to their needs. Your Expertise 3+ years of experience in new sales, account management, or partner support. 2+ years of hospitality/travel industry experience (nice to have). Strong time management and prioritization skills, with the ability to manage multiple accounts effectively. Proven experience working a book of business, driving engagement and growth through proactive account management. Highly goal-driven, with a strong bias for action and persistence in the face of challenges. Excellent communication and presentation skills, with the ability to engage effectively via phone, email, and in-person. Proficiency in CRM tools, particularly working with leads and opportunities (Salesforce experience is a plus). Fluency in English & Spanish (mandatory). Fluency in Portuguese (nice to have). Your Location: Due to the nature of this position, the successful applicant will need to be based in the state of Georgia or Florida to be able to conduct their work. If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from. Our Commitment To Inclusion & Belonging Airbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply. We strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: reasonableaccommodations@airbnb.com. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process. We ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application. How We'll Take Care Of You Our job titles may span more than one career level. The actual base pay is dependent upon many factors, such as: training, transferable skills, work experience, business needs and market demands. The base pay range is subject to change and may be modified in the future. This role may also be eligible for bonus, equity, benefits, and Employee Travel Credits. Pay Range $88,000—$103,000 USD",
    "linkedin_job_id": "4333994192"
  },
  {
    "company_name": "Cultivating Literacy",
    "linkedin_company_page": "https://www.linkedin.com/company/cultivating-literacy/life",
    "title": "Vietnamese/English Reading Coach (Contract)",
    "job_location": "Remote",
    "posted_date": "1 day ago",
    "applicant_count": "United States · 1 day ago · 11 applicants\nPromoted by hirer · Actively reviewing applicants",
    "salary": "Not specified",
    "description": "About the job Cultivating Literacy reading teachers support families in implementing our reading program at home with their children. The teacher will conduct check-ins via phone call or video call. They will work closely with our program manager to monitor and track families' success. Responsibilities Providing individualized support to families of young readers Orally translate curriculum instructions as needed to parents who speak English and/or Vietnamese as their first language Guide families' progress using an online portal and one-on-one calls (video or phone) Work with our program manager to help support families and ensure satisfaction Qualifications Bachelor’s degree (preferably in education) Classroom experience (formal or informal) Familiarity with early reading foundations such as phonics, phonological awareness, and comprehension Bilingual in Vietnamese and English Experience using Google Suite (Gmail, Drive, Docs, Sheets, Slides, etc.) Cultivating Literacy’s mission: We cultivate diverse family support systems through engaging play-based learning to develop students' reading confidence. Our vision is that every child will know their full potential. This position will work with our Dual-Language Individualized Literacy Plan program: Designed to help 4-7-year-old children who need further instruction and practice in reading. Children undergo a reading assessment, and results are used to craft a custom 9-week reading plan. Parents implement the plan with their children while a reading coach guides them throughout their journey. At the end of the program, children exhibit growth in early literacy skills and confidence, while parents express feeling further agency in supporting their child’s reading. Compensation: Cultivating Literacy will provide the following compensation $25-$35 per hour; option to choose how much or little work based on your schedule Flexible schedule: based primarily on your schedule Room to grow with the organization Other helpful links Parent Testimonial (Individualized Literacy Plan program), https://youtu.be/sQNya2ELOvc?si=pZYOuEwWTsZkVYUO Example Reading Strategy, https://youtu.be/ZHuFmk8WDwA?si=r4Cig6bw3sIHHS3f Cultivating Literacy is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws.",
    "linkedin_job_id": "4333971057"
  },
  {
    "company_name": "Toloka Annotators",
    "linkedin_company_page": "https://www.linkedin.com/company/toloka-annotators/life",
    "title": "AI Trainer - Freelance Annotator (Chinese)",
    "job_location": "Texas, United States",
    "posted_date": "1 week ago",
    "applicant_count": "Texas, United States · 1 week ago · 4 applicants\nNo response insights available yet",
    "salary": "Not specified",
    "description": "About the job Please submit your resume in English and indicate your level of English. At Toloka, we connect smart, curious people from around the world with freelance online tasks that train and improve artificial intelligence. What We Do The Toloka Annotators connects individuals with Generative AI projects from leading tech innovators. Our mission is to unlock the full potential of AI by involving real people from around the world in the development process. About The Role Annotation is what helps AI make sense of the world. As an annotator, you may be invited to take part in online projects such as rating AI-generated content, evaluating factual accuracy, or comparing responses - when projects are available. Responsibilities: Carefully review provided data (text, images, or videos) Label or classify content based on project guidelines Identify and flag factually incorrect, sensitive, inappropriate, or unclear material Important note: This is project-based work. Tasks are available only when projects are active. You may be invited to one or more projects depending on your profile and current opportunities. Requirements You hold or are pursuing a Bachelor's, Master's, or PhD Degree in any professional discipline You have advanced proficiency in Chinese (C1 or above) and a B2 level of English, both written and spoken User-friendly experience in data annotation (nice to have) Logical thinking, fact-checking and reasoning abilities Strong attention to detail and ability to understand and follow complex instructions Genuine interest in technology and artificial intelligence Benefits Why this freelance opportunity might be a great fit for you? Get paid for your expertise, with rates that can go up to $18/hour depending on your skills, experience, and project needs Take part in a part-time, remote, freelance project that fits around your primary professional or academic commitments Work on advanced AI projects and gain valuable experience that enhances your portfolio Influence how future AI models understand and communicate in your field of expertise",
    "linkedin_job_id": "4332856730"
  },
  {
    "company_name": "Coinbase",
    "linkedin_company_page": "https://www.linkedin.com/company/coinbase/life",
    "title": "HR Business Partner",
    "job_location": "Remote",
    "posted_date": "Reposted 5 days ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Ready to be pushed beyond what you think you’re capable of? At Coinbase, our mission is to increase economic freedom in the world. It’s a massive, ambitious opportunity that demands the best of us, every day, as we build the emerging onchain platform — and with it, the future global financial system. To achieve our mission, we’re seeking a very specific candidate. We want someone who is passionate about our mission and who believes in the power of crypto and blockchain technology to update the financial system. We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up. We want someone who will run towards, not away from, solving the company’s hardest problems. Our work culture is intense and isn’t for everyone. But if you want to build the future alongside others who excel in their disciplines and expect the same from you, there’s no better place to be. While many roles at Coinbase are remote-first, we are not remote-only. In-person participation is required throughout the year. Team and company-wide offsites are held multiple times annually to foster collaboration, connection, and alignment. Attendance is expected and fully supported. The HR Business Partner will support one or more functional teams playing a vital role in ensuring the functions they partner with are thriving and executing people programs at scale -- and, most importantly, translating business strategy into people & org strategy over time. As a key member of our People team, you will work closely with functional leaders on engagement, org health, performance management, employee development, diversity, policy, etc. You’ll provide proactive guidance and counsel and will have the opportunity to improve and impact every employee's experience at Coinbase. Using data, combined with sound judgment and creativity, you’ll directly influence the growth & scale of our organization. We’re looking for an innovative person to help us continue to build a best in class team. What you’ll be doing (ie. job duties): Work with relevant stakeholders to help spearhead people programs and strategies that enhance our culture -- including performance management, compensation, talent development & feedback, employee engagement & retention, and internal communications. Partner with functional leaders on org design, planning, and relevant people strategies at scale. Regularly provide coaching/guidance on skill & professional development, career pathing and leveling, change management, and sensitive people situations. Identify and advise leaders on the development needs of their teams and functions. Approach people matters with an eye toward compliance and reducing risks; help build and apply HR policies and manage global employee relations issues. Analyze trends & use data to develop people's insights and influence change. Build excellent working relationships across the business and our People Team COEs. What we look for in you (ie. job requirements): Minimum of 7 years of relevant experience as a HR professional, chief of staff, or consultant. Solid mindset and ability to create, improve, and execute on people processes and programs with efficient execution. Proven stakeholder management skills with capability to navigate nuanced and elevated situations with poise and good judgment - separating signal from noise. Data driven decision making experience or examples of analytical thinking patterns Demonstrated skills in clear communication and escalation methods. Comfortability with stepping into feedback conversations throughout all levels of the organization. Ability to thrive in a fast-paced environment with ever-changing priorities. Motivation to problem solve in an ambiguous environment. Reputation for integrity, confidentiality, dedicated work ethic, and desire for ownership & accountability. P72558 Pay Transparency Notice: Depending on your work location, the target annual salary for this position can range as detailed below. Full time offers from Coinbase also include bonus eligibility + equity eligibility + benefits (including medical, dental, vision and 401(k)). Pay Range: : $176,035 USD - $207,100 USD Please be advised that each candidate may submit a maximum of four applications within any 30-day period. We encourage you to carefully evaluate how your skills and interests align with Coinbase's roles before applying. Commitment to Equal Opportunity Coinbase is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law. For US applicants, you may view the Employee Rights and the Know Your Rights notices by clicking on their corresponding links. Additionally, Coinbase participates in the E-Verify program in certain locations, as required by law. Coinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please contact us at accommodations[at]coinbase.com to let us know the nature of your request and your contact information. For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here). Global Data Privacy Notice for Job Candidates and Applicants Depending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here. By submitting your application, you are agreeing to our use and processing of your data as required. For US applicants only, by submitting your application you are agreeing to arbitration of disputes as outlined here. AI Disclosure For select roles, Coinbase is piloting an AI tool based on machine learning technologies to conduct initial screening interviews to qualified applicants. The tool simulates realistic interview scenarios and engages in dynamic conversation. A human recruiter will review your interview responses, provided in the form of a voice recording and/or transcript, to assess them against the qualifications and characteristics outlined in the job description. For select roles, Coinbase is also piloting an AI interview intelligence platform to transcribe and summarize interview notes, allowing our interviewers to fully focus on you as the candidate. The above pilots are for testing purposes and Coinbase will not use AI to make decisions impacting employment. To request a reasonable accommodation due to disability, please contact accommodations[at]coinbase.com",
    "linkedin_job_id": "4312368841"
  },
  {
    "company_name": "Biogen",
    "linkedin_company_page": "https://www.linkedin.com/company/biogen-/life",
    "title": "Sr. Payroll Specialist, US Payroll",
    "job_location": "Remote",
    "posted_date": "Reposted 4 days ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job About This Role As a Senior Payroll Specialist within our Global Business Services team, you will play a crucial role in processing payroll for your assigned country, ensuring accuracy and compliance with relevant laws and regulations. Your responsibilities will involve executing payroll processes in a timely manner, troubleshooting systems as needed, and collaborating efficiently with customers and stakeholders. This position is integral to maintaining smooth payroll operations, thereby supporting the company’s overall business objectives. In addition, you will contribute to the enhancement and optimization of payroll systems, continuously improving process documentation. By ensuring all payroll transactions are compliant with internal policies and government regulations, you will directly impact the satisfaction and trust of our employees. What You’ll Do Process regular and off-cycle US payroll, including collecting payroll inputs and calculating payroll to ensure timely payment to employees. Ensure all payroll transactions comply with internal policies and procedures, as well as government regulations, including timely tax payments and document filing. Provide support to team members when needed by acting as a backup and participating in knowledge sharing. Keep process documentation up to date and suggest improvements to promote efficiency and systems optimization. Deliver exceptional support to employees and stakeholders, resolving tickets and requests promptly and ensuring regular communication. Collaborate with other departments to support payroll-related projects and initiatives. Who You Are You are someone who thrives in a collaborative environment, valuing the importance of teamwork and communication. Your keen attention to detail ensures accuracy in payroll processing, and you possess a proactive attitude when it comes to problem-solving and process improvements. You are committed to providing exceptional service to stakeholders and employees, maintaining a customer-focused approach. Your ability to learn quickly and adapt to changes makes you an invaluable asset to the team. Required Skills University degree in finance, accounting, management, or equivalent professional payroll training/coursework. 2+ years of payroll processing experience. Understanding of payroll tax laws and regulations across various jurisdictions. Knowledge of accounting principles and practices related to payroll. Competence in auditing payroll records and reports for accuracy and compliance. Experience in managing the execution of defined actions and monitoring completion with multiple stakeholders. Strong communication and interpersonal skills. Ability to work independently and manage multiple tasks efficiently. Preferred Skills Experience with process improvement methodologies. Experience with UKG Pro platform Proficient in Microsoft Excel Job Level: Professional Additional Information The base compensation range for this role is: $66,000.00-$86,000.00 Base salary offered is determined through an analytical approach utilizing a combination of factors including, but not limited to, relevant skills & experience, job location, and internal equity. Regular employees are eligible to receive both short term and long-term incentives, including cash bonus and equity incentive opportunities, designed to reward recent achievements and recognize your future potential based on individual, business unit and company performance. Benefits In addition to compensation, Biogen offers a full and highly competitive range of benefits designed to support our employees’ and their families physical, financial, emotional, and social well-being; including, but not limited to: Medical, Dental, Vision, & Life insurances Fitness & Wellness programs including a fitness reimbursement Short- and Long-Term Disability insurance A minimum of 15 days of paid vacation and an additional end-of-year shutdown time off (Dec 26-Dec 31) Up to 12 company paid holidays + 3 paid days off for Personal Significance 80 hours of sick time per calendar year Paid Maternity and Parental Leave benefit 401(k) program participation with company matched contributions Employee stock purchase plan Tuition reimbursement of up to $10,000 per calendar year Employee Resource Groups participation Why Biogen? We are a global team with a commitment to excellence, and a pioneering spirit. As a mid-sized biotechnology company, we provide the stability and resources of a well-established business while fostering an environment where individual contributions make a significant impact. Our team encompasses some of the most talented and passionate achievers who have unparalleled opportunities for learning, growth, and expanding their skills. Above all, we work together to deliver life-changing medicines, with every role playing a vital part in our mission. Caring Deeply. Achieving Excellence. Changing Lives. At Biogen, we are committed to building on our culture of inclusion and belonging that reflects the communities where we operate and the patients we serve. We know that diverse backgrounds, cultures, and perspectives make us a stronger and more innovative company, and we are focused on building teams where every employee feels empowered and inspired. Read on to learn more about our DE&I efforts. All qualified applicants will receive consideration for employment without regard to sex, gender identity or expression, sexual orientation, marital status, race, color, national origin, ancestry, ethnicity, religion, age, veteran status, disability, genetic information or any other basis protected by federal, state or local law. Biogen is an E-Verify Employer in the United States.",
    "linkedin_job_id": "4317965007"
  },
  {
    "company_name": "Hanmer Springs TOP 10 Holiday Park",
    "linkedin_company_page": "https://www.linkedin.com/company/hanmer-springs-top-10-holiday-park/life",
    "title": "language translator",
    "job_location": "California, United States",
    "posted_date": "5 days ago",
    "applicant_count": "Over 100 applicants",
    "salary": "Not specified",
    "description": "About the job Job Opportunity: Professional Language Translator We are currently seeking a highly skilled and professional Language Translator to join our team. The ideal candidate will be fluent in multiple languages and possess strong linguistic and cultural knowledge. You will be responsible for translating written and spoken materials while ensuring the meaning, tone, and context are accurately preserved across languages. Responsibilities: Translate documents, audio files, and video content with high accuracy. Ensure that all translations retain the original meaning, style, and tone. Proofread and edit translations to ensure clarity and quality. Collaborate with the team to meet project requirements and deadlines. Maintain confidentiality and integrity of all client information. Stay updated with current language trends and industry terminology. Project Details: We currently have an English document of 11,638 words (44 pages) that needs to be translated into the following languages: Chinese (Traditional – Taiwan) Chinese (Simplified) Japanese Korean French German Italian Spanish Portuguese Romanian Dutch Polish Arabic Icelandic Turkish Swedish Norwegian Russian Ukrainian Indonesian Bengali Urdu Hindi Filipino Other languages are also welcome Requirements: Fluent in English or one of the languages listed above (in writing). Proven experience in translation (written and/or spoken). High attention to detail and cultural nuance. Interested? If you are available and interested in this opportunity, please contact us at: Email: dubnerfredrick841@gmail.com We look forward to working with talented translators from around the world.",
    "linkedin_job_id": "4319953981"
  },
  {
    "company_name": "SportsRecruits",
    "linkedin_company_page": "https://www.linkedin.com/company/sports-recruits-llc/life",
    "title": "Full Stack Software Engineer (Vue/Laravel) – Remote",
    "job_location": "Brooklyn, NY",
    "posted_date": "9 hours ago",
    "applicant_count": "16 applicants",
    "salary": "Not specified",
    "description": "About the job Full Stack Software Engineer (Remote) Location: Remote (US-based) Reports to: CTO, SportsRecruits About SportsRecruits SportsRecruits is the leading sports recruiting network, connecting athletes, clubs, events, and college coaches in the recruiting process. The company’s network and tools are trusted by sports organizations such as the IWLCA, IMLCA, NFHCA, and Junior Volleyball Association. Every year, millions of connections are made on the network, resulting in commitments to the best academic and athletic institutions. SportsRecruits is part of IMG Academy, the world's leading sports education brand. IMG Academy provides a holistic education model that empowers student-athletes to win their future, preparing them for college and for life. IMG Academy provides growth opportunities for all student-athletes through an innovative suite of on-campus and online experiences: Boarding school and camps, via a state-of-the-art campus in Bradenton, Fla Online coaching via IMG Academy+, with a focus on personal development through the lens of sport and performance Online college recruiting, via NCSA and SportsRecruits, providing unmatched college recruiting education and services to student-athletes and their families, club coaches, and event operators, and is the premier service for college coaches SportsRecruits is an equal opportunity employer and embraces diversity and equal opportunity on our team. Just like the student-athletes we support, we are trying to get better and stronger as a team everyday. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. We truly believe that the more inclusive our team is, the better we can serve all student-athletes, as well as their families and coaches, who are pursuing their dreams. About The Team We are a product development team full of fun, intelligent, happy, and hardworking engineers, designers and product managers distributed across the United States. We are scaling our network and building innovative tools to empower student athletes, college coaches, and event operators. Our tools are built on top of technologies that span mobile and web applications, computer vision, and LLMs. Your input, code and problem solving skills will make a direct impact in how we scale and grow the company. Our stack includes: Laravel + PHP8 backend APIs Vue.js (v2 and v3) + Inertia.js + Tailwind frontend React Native mobile applications Python for internal tools and ML/LLM-based features Infrastructure as code with Terraform, AWS Fargate, and a Jenkins-based CI/CD pipeline We emphasize performance, security, and maintainability—and we love solving problems that have real-world impact on student-athletes, coaches, and partners. About The Position What You’ll Do As a mid-level Full-Stack Engineer, you’ll play a critical role across the entire software lifecycle: Implement, and optimize new features across web and mobile platforms Contribute to our Vue.js frontend (Inertia.js) and Laravel-based API Collaborate with product managers, designers, and QA to deliver intuitive, high-impact experiences You will contribute to solving complex problems that will make our platform even better at connecting thousands of student athletes and college programs. Some interesting projects we’ve recently worked on are: In-browser video clipping and editing with computer vision driven isolation effects React-native based hybrid iOS/Android app Tools for partner events to import rosters of athletes with built-in column mapping, de-duping and validation rules to automatically merge duplicate user data About You Must-Haves: 2-3 years of professional software engineering experience Expertise in at least one modern programming languages (e.g., PHP, Python, JavaScript, TypeScript) Experience with at least one PHP MVC framework (Laravel or Symfony) Strong frontend experience with Vue, React, or similar frameworks Familiarity with relational databases (MySQL, PostgreSQL, etc.) Comfortable writing and maintaining automated tests (unit, integration, E2E) Passion for clean code, system design, and scalable architecture Strong communication skills, positive attitude, and a collaborative mindset Nice-to-Haves: Laravel, Vue, or TailwindCSS experience Experience working with 3rd-party APIs and async job queues (SQS, Redis) Knowledge of AI tooling, LLM integration, or computer vision Exposure to agile methodologies (Scrum, Kanban, XP) Why Join Us? Meaningful Work: Help shape a platform that impacts thousands of student-athletes’ futures Modern Stack: Work with Laravel, Vue, React Native, Python, and AWS, backed by great tooling and infrastructure Growth-Oriented Culture: We prioritize learning, experimentation, and continuous improvement Remote Flexibility: We’re a distributed team with asynchronous workflows and clear communication practices Benefits & Compensation Competitive salary: $100,000 – $125,000 per year Remote-first team culture Health, dental, and vision coverage 401(k) with company match Unlimited vacation policy Powered by JazzHR yEdtjhFkby",
    "linkedin_job_id": "4334212762"
  },
  {
    "company_name": "ExecutivePlacements.com",
    "linkedin_company_page": "https://www.linkedin.com/company/executive-placements/life",
    "title": "Remote Worker Needed",
    "job_location": "Worcester, MA",
    "posted_date": "Worcester, MA · 1 hour ago · 5 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job \"Ten Side Hustles You Can Do Even While Youre Still on the ClockIf your goal is to make some extra cash, you've come to the right place. If you want to make money from home, online, or get out of the house to earn your extra cash, we've got you covered with these easy money-making ideas.\"",
    "linkedin_job_id": "4334355395"
  },
  {
    "company_name": "Zachary Piper Solutions",
    "linkedin_company_page": "https://www.linkedin.com/company/zachary-piper-solutions/life",
    "title": "Senior MEAN Developer - REMOTE",
    "job_location": "Remote",
    "posted_date": "United States · 15 hours ago · 63 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Zachary Piper Solutions is seeking a Senior Software Developer to join a Federal Program. The Senior Software Developer will be responsible for development, maintenance, and testing of microservices built on the MEAN stack. Responsibilities of the Senior Software Developer include: Design, develop, test, maintain, and document high-quality software solutions. Tackle complex technical challenges with innovative and effective solutions. Continuously learn and apply new technologies to enhance software capabilities. Manage and maintain corporate software libraries and development tools. Diagnose and resolve software defects and issues in a timely manner. Collaborate with cross-functional teams to support application design and usage. Communicate complex technical concepts clearly across various levels of the organization. Provide technical mentorship and guidance to peers. Work effectively both independently and as part of a team, demonstrating professionalism, problem-solving skills, and strong communication abilities. Qualifications for the Senior Software Developer include: Bachelor’s degree in Computer Science or a related technical field. 5–7 years of experience designing and developing web-based applications. Proficiency with the MEAN stack (MongoDB, Express.js, Angular, Node.js). Experience developing RESTful web services. Familiarity with microservice-based architectures. Understanding of secure system design and implementation. Strong verbal and written communication skills, with the ability to quickly learn and adapt in a dynamic environment. Must be able to obtain and maintain a U.S. government security clearance. Compensation for the Senior Software Developer includes: Salary Range: $110,000 - $135,000 depending on experience Comprehensive Benefits: Cigna Medical, Dental, Vision, 401K, PTO, Sick Leave if required by law, and Holidays Keywords: software development, web development, MEAN stack, MongoDB, Express.js, Angular, Node.js, RESTful APIs, microservices, secure systems, software architecture, software testing, software maintenance, documentation, technical mentoring, problem-solving, team collaboration, independent work, communication skills, software libraries, application design, software troubleshooting, DoD clearance, security clearance, software engineering, backend development, frontend development, full stack, agile development, DevOps, continuous integration, continuous deployment, version control, Git, JavaScript, TypeScript, HTML, CSS, cloud computing, AWS, Azure, Docker, Kubernetes, system design, scalability, performance optimization, debugging, code review, software lifecycle, technical leadership, innovation, adaptability, fast-paced environment, technical consulting, cross-functional teams, software infrastructure, software quality, software reliability, software security, technical documentation, professional development, software best practices.",
    "linkedin_job_id": "4320624302"
  },
  {
    "company_name": "Accrue",
    "linkedin_company_page": "https://www.linkedin.com/company/byaccrue/life",
    "title": "Compliance Analyst (Remote, Nights and Weekends)",
    "job_location": "Remote",
    "posted_date": "United States · 6 hours ago · 21 people clicked apply\nResponses managed off LinkedIn",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job About Our Team Accrue is a fintech company that powers modern customer loyalty at the payment layer. Centered around its branded stored value wallet solution, Accrue’s platform helps brands take control of their payments and refunds, reward customer loyalty, and bypass traditional payment giants. ‍ Build a deeper, more durable customer base while optimizing your bottom line – all with Accrue. About The Role We’re seeking a Compliance Analyst to join our team and play a key role in monitoring transactions, identifying suspicious activity, and preventing fraud. This person will work closely with our operations and product teams to ensure we maintain robust controls and compliance with all relevant regulations. This role will also assist with product support and operational escalations as needed. This is a hands-on role suited for someone who thrives in a dynamic environment, enjoys solving problems with data, and wants to make a tangible impact on risk management at a growing startup. Schedule- The work hours for this role will be approximately: Wednesday- Friday: 3:00-9:30 p.m EST, Saturday: 10:00-8:30 p.m EST, Sunday: 11:00-8:00 p.m EST. Job Requirements What you’ll do Monitor real-time transactions for signs of suspicious or fraudulent activity. Investigate alerts from fraud detection systems and escalate findings as needed. Review customer activity and documentation for compliance with internal policies and regulatory requirements. Maintain accurate and timely records of investigations and findings. Collaborate with cross-functional teams (product, engineering, customer success) to improve detection and prevention systems. Assist with regulatory reporting, audits, and compliance reviews. Stay current on AML, KYC, and fraud trends and recommend process improvements. Product support and operational escalations as needed. What you'll need 2+ years of experience in compliance, fraud prevention, or AML within a financial services or fintech organization. Robust analytical skills and attention to detail. Familiarity with tools and systems for transaction monitoring or case management. Understanding of KYC, AML, and fraud prevention best practices. Excellent communication and documentation skills. Comfortable working in a fast-moving, data-driven environment. What we'd love to see Experience working with regulatory frameworks such as BSA/AML, OFAC, or FinCEN guidelines. Experience in fintech or startup environments. Previous experience with Sardine. Certification such as CAMS or CFE a plus. Benefits & perks Robust health benefits packages (1 of our 4 medical plans cost $0 for full family coverage) Company contributed 401k An empathetic team that values mental wellness and work/life balance Ground floor opportunity to bring a product to market that helps people in a way that doesn't exist today Work Authorization Accrue does not provide employment sponsorship. Candidates must be currently authorized to work in the United States on a full-time basis. Salary Information The range listed below is just one component of Accrue's total compensation package; This role will receive a competitive salary + benefits + equity. The salary range is for US-based employees located in the listed market. Other benefits include those listed above such as healthcare and 401k with 3% contribution. Salary Range $55,000 - $80,000 USD Accrue is an equal opportunity employer committed to fostering an inclusive, innovative environment. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please contact us at talent@accruemoney.com.",
    "linkedin_job_id": "4337830527"
  },
  {
    "company_name": "Google",
    "linkedin_company_page": "https://www.linkedin.com/company/google/life",
    "title": "Executive Support Agent",
    "job_location": "New York, United States",
    "posted_date": "New York, United States · Reposted 1 hour ago · Over 100 people clicked apply\nPromoted by hirer · Responses managed off LinkedIn",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Note: Google's hybrid workplace includes remote roles. By applying to this position you will have an opportunity to share your preferred working location from the following: Remote locations: District of Columbia, USA; New York, USA.Minimum qualifications: Bachelor's degree or equivalent practical experience. Certification in Law Enforcement Officers Safety Act (LEOSA). 10 years of experience in security, law enforcement, or military fields. Experience in supporting high-profile response plans and conducting executive protection travel advances, including specialized transportation logistics. Ability to maintain valid U.S. driver’s license, pass pre-employment and unscheduled drug testing during employment. Preferred qualifications: Ability to operate in changing environments. Ability to make judgment and to solve regional security problems through analysis and collaboration with executive security leadership. Excellent communication and documentation skills. About the jobSecurity is at the core of Google's design and development process: it is built into the DNA of our products. The same is true of our offices. You're an expert who shares our seriousness about security and our commitment to confidentiality. You'll collaborate with our Facilities Management team to create innovative security strategies, investigate breaches and create risk assessment plans for the future. You believe that providing effective security doesn't come at the expense of customer service - you will be our bodyguard (and our long lost pal).From keeping Googlers safe and secure to managing disruptive events, the ability to anticipate, deter, detect, and act are the pillars of Google’s Global Security and Resilience Services (GSRS) team. As a member of GSRS you will help develop a culture where safety, security and resiliency are integrated into every facet of Google, including the creative process. You will help us continually identify, evaluate and monitor enterprise risks that could affect business activities and provide business leaders the information they need to make critical decisions. You'll collaborate with cross-functional teams to create innovative strategies and develop programs that drive sustainable effectiveness. The US base salary range for this full-time position is $132,000-$194,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google . Responsibilities Develop executive security strategy, including proactive and reactive protocols and processes to keep Googlers safe and maintain and execute protocols and practices to assess and mitigate threats to company assets, managing crises and delivering threat assessment services by collecting, evaluating, and disseminating accurate and timely intelligence information to appropriate stakeholders. Collect feedback, ensure documentation is up to date, and facilitate discussions to follow up with stakeholders; propose or implement changes for improvement. Predict, prevent, or avoid tense or dangerous situations, and react as situations emerge. Screen client itineraries and conduct research and intelligence gathering to identify risk factors or form an operational plan for client protection. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
    "linkedin_job_id": "4314711431"
  },
  {
    "company_name": "Cribl",
    "linkedin_company_page": "https://www.linkedin.com/company/cribl/life",
    "title": "Software Engineer, Backend",
    "job_location": "Remote",
    "posted_date": "Reposted 5 days ago",
    "applicant_count": null,
    "salary": "Not specified",
    "description": "About the job Cribl does differently. What does that mean? It means we are a serious company that doesn’t take itself too seriously; and we’re looking for people who love to get stuff done, and laugh a bit along the way. We’re growing rapidly - looking for collaborative, curious, and motivated team members who are passionate about putting customers first. As a remote-first company we believe in empowering our employees to do their best work, wherever they are. As the data engine for IT and Security many of the biggest names in the most demanding industries trust Cribl to solve their most pressing data needs. Ready to do the best work of your career? Join the herd and unlock your opportunity. Why You’ll Love This Role Cribl Stream unlocks the value of all machine data in ways that were previously not possible by providing users a new level of observability, intelligence and control over their real-time data. We are looking for talented engineers to help build scalable, reliable, and intuitive features that empower our customers to operate Cribl Stream with confidence and agility. As a Staff Engineer working on the Stream Control Plane, you will be a technical expert working alongside skilled engineers as part of a cross functional team that delivers highly reliable and scalable software to drive customer value and satisfaction. This role is equal parts research and development. If you enjoy the challenges of building scalable, robust, and high performing distributed systems that process large data sets in real time, this position may be right for you. This is a fully remote role and Cribl is a remote first company. Our culture embraces the diversity of team members spread all across the globe. As An Active Member Of Our Team, You Will… Develop software that powers the reliable and scalable operation of Cribl Stream such as deployment, configuration, and orchestration of distributed nodes at high scale Work with a cross functional team of engineers, product managers, and designers to translate feature requirements into technical designs and implementable code Develop, test, and maintain robust code that effectively delivers customer value Develop automated tests and comprehensive test plans to ensure high quality code and product features that work as expected Champion teamwork, engineering best practices, and a customer focused mindset Introduce performance and efficiency improvements across our products and processes Help maintain and support our SaaS products including periodic participation in our 24x7 on-call rotations This position will require stand-by, on-call, or off-hours duties If You’ve Got It - We Want It BS in CS and 2+ years of industry experience / MS in CS Hands-on coding contributions on multiple projects that have shipped to production Experience working on enterprise software running in Cloud (AWS, GCP, Azure) Has built and used production APIs (e.g. REST, RPC) Has participated in production on-call and incident response Experience using Javascript test frameworks (e.g. Playwright, Codecept, Mocha, Cypress, Jest) Knowledge/experience in data streaming & transformation, high volume telemetry, logs, metrics and observability Hands-on coding experience with NodeJS, TypeScript, JavaScript Experience working in startup/fast-paced work environments, Agile software development, remote/hybrid work Salary Range ($145,000 - $175,000) The salary for this role is dependent on geographic location. The salary offered within the range described will be based on the individual candidate’s job-related knowledge, skills, and experience. In addition to a competitive salary, Cribl also offers a generous benefits package which includes health, dental, vision, short-term disability, and life insurance, paid holidays and paid time off, a fertility treatment benefit, 401(k), equity, and eligibility for a discretionary company-wide bonus. Bring Your Whole Self Diversity drives innovation, enables better decisions to support our customers, and inspires change for the better. We’re building a culture where differences are valued and welcomed, and we work together to bring out the best in each other. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying. Interested in joining the Cribl herd? Learn more about the smartest, funniest, most passionate goats you’ll ever meet at cribl.io/about-us.",
    "linkedin_job_id": "4307565204"
  }
]